<html>
<head><title>&#1040;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1091;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1077;&#1085;&#1080;&#1103; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1090;&#1086;&#1084;&#1086;&#1074;</title>
<meta content="text/html; charset=UTF-8" http-equiv="content-type">
<style type="text/css">ol{margin:0;padding:0}.c2{border-right-style:solid;padding:5pt 5pt 5pt 5pt;border-bottom-color:#000000;border-top-width:1pt;border-right-width:1pt;border-left-color:#000000;vertical-align:top;border-right-color:#000000;border-left-width:1pt;border-top-style:solid;border-left-style:solid;border-bottom-width:1pt;width:199.3pt;border-top-color:#000000;border-bottom-style:solid}.c8{border-right-style:solid;padding:5pt 5pt 5pt 5pt;border-bottom-color:#000000;border-top-width:1pt;border-right-width:1pt;border-left-color:#000000;vertical-align:top;border-right-color:#000000;border-left-width:1pt;border-top-style:solid;border-left-style:solid;border-bottom-width:1pt;width:35.6pt;border-top-color:#000000;border-bottom-style:solid}.c28{border-right-style:solid;padding:5pt 5pt 5pt 5pt;border-bottom-color:#000000;border-top-width:1pt;border-right-width:1pt;border-left-color:#000000;vertical-align:top;border-right-color:#000000;border-left-width:1pt;border-top-style:solid;border-left-style:solid;border-bottom-width:1pt;width:451.3pt;border-top-color:#000000;border-bottom-style:solid}.c15{border-right-style:solid;padding:5pt 5pt 5pt 5pt;border-bottom-color:#000000;border-top-width:1pt;border-right-width:1pt;border-left-color:#000000;vertical-align:top;border-right-color:#000000;border-left-width:1pt;border-top-style:solid;border-left-style:solid;border-bottom-width:1pt;width:216.4pt;border-top-color:#000000;border-bottom-style:solid}.c6{color:#000000;font-weight:normal;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:"Arial";font-style:normal}.c20{color:#ff0000;font-weight:normal;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:"Arial";font-style:normal}.c0{padding-top:0pt;padding-bottom:0pt;line-height:1.15;text-align:left;direction:ltr;height:11pt}.c7{padding-top:0pt;padding-bottom:0pt;line-height:1.15;text-align:left;direction:ltr}.c1{margin-left:36pt;orphans:2;widows:2;direction:ltr}.c3{font-size:8pt;font-family:"Courier New";font-weight:bold}.c29{background-color:#ffffff;max-width:451.4pt;padding:72pt 72pt 72pt 72pt}.c4{orphans:2;widows:2;direction:ltr}.c25{border-collapse:collapse;margin-right:auto}.c21{font-size:8pt;font-family:"Courier New"}.c27{color:#5b9bd5;font-size:18pt}.c10{color:#1155cc;text-decoration:underline}.c14{color:inherit;text-decoration:inherit}.c19{color:#404040;font-size:18pt}.c26{color:#595959;font-size:10pt}.c13{text-align:right}.c18{font-size:14pt}.c11{font-weight:bold}.c17{font-style:italic}.c23{height:0pt}.c9{text-indent:-18pt}.c5{height:11pt}.c16{font-size:12pt}.c22{color:#404040}.c24{margin-left:18pt}.c12{font-size:9pt}.title{padding-top:0pt;color:#000000;font-size:21pt;padding-bottom:0pt;font-family:"Trebuchet MS";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}.subtitle{padding-top:0pt;color:#666666;font-size:13pt;padding-bottom:10pt;font-family:"Trebuchet MS";line-height:1.15;page-break-after:avoid;font-style:italic;orphans:2;widows:2;text-align:left}li{color:#000000;font-size:11pt;font-family:"Arial"}p{margin:0;color:#000000;font-size:11pt;font-family:"Arial"}h1{padding-top:10pt;color:#000000;font-size:16pt;padding-bottom:0pt;font-family:"Trebuchet MS";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h2{padding-top:10pt;color:#000000;font-weight:bold;font-size:13pt;padding-bottom:0pt;font-family:"Trebuchet MS";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h3{padding-top:8pt;color:#666666;font-weight:bold;font-size:12pt;padding-bottom:0pt;font-family:"Trebuchet MS";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h4{padding-top:8pt;color:#666666;text-decoration:underline;font-size:11pt;padding-bottom:0pt;font-family:"Trebuchet MS";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h5{padding-top:8pt;color:#666666;font-size:11pt;padding-bottom:0pt;font-family:"Trebuchet MS";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h6{padding-top:8pt;color:#666666;font-size:11pt;padding-bottom:0pt;font-family:"Trebuchet MS";line-height:1.15;page-break-after:avoid;font-style:italic;orphans:2;widows:2;text-align:left}</style>
</head>
<body class="c29"><p class="c4 c13">
<span class="c27">&#1040;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1091;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1077;&#1085;&#1080;&#1103; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1090;&#1086;&#1084;&#1086;&#1074;</span>
</p>
<p class="c4 c13 c5"><span class="c19"></span></p><p class="c4 c5 c13"><span class="c19"></span></p><p class="c4 c13"><span class="c18 c22">&#1050;&#1086;&#1076;-&#1087;&#1088;&#1086;&#1090;&#1086;&#1090;&#1080;&#1087; &#1085;&#1072; JavaScript &#1091;&#1074;&#1077;&#1088;&#1077;&#1085;&#1085;&#1086; &#1086;&#1073;&#1075;&#1086;&#1085;&#1103;&#1077;&#1090; &#1087;&#1086; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1080; &#1073;&#1072;&#1079;&#1086;&#1074;&#1091;&#1102; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1091;&#1102; &#1091;&#1090;&#1080;&#1083;&#1080;&#1090;&#1091; DISKPART.EXE &#1087;&#1088;&#1080; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1080; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; &#1091;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1077;&#1085;&#1080;&#1103; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1090;&#1086;&#1084;&#1086;&#1074;</span>
</p><p class="c4 c5"><span></span></p><p class="c4 c5"><span></span></p>
<p class="c4"><span class="c26">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;, &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1074; &#1087;&#1088;&#1086;&#1090;&#1086;&#1090;&#1080;&#1087;-&#1082;&#1086;&#1076;&#1077; &#1085;&#1072; JavaScript &#1091;&#1074;&#1077;&#1088;&#1077;&#1085;&#1085;&#1086; &#1086;&#1087;&#1077;&#1088;&#1077;&#1078;&#1072;&#1077;&#1090; &#1087;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; &#1086;&#1087;&#1086;&#1088;&#1085;&#1091;&#1102; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1091;&#1102; &#1091;&#1090;&#1080;&#1083;&#1080;&#1090;&#1091; DISKPART.EXE. &#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1099; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1099; &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1073;&#1072;&#1079;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;. &#1044;&#1072;&#1085;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1077; &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1077;&#1085;&#1080;&#1077;, &#1085;&#1086; &#1085;&#1077; &#1076;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1086;, &#1090;&#1086;&#1084;&#1091;, &#1087;&#1086;&#1095;&#1077;&#1084;&#1091; DISKPART.EXE &#1088;&#1077;&#1096;&#1072;&#1077;&#1090; &#1079;&#1072;&#1076;&#1072;&#1095;&#1091; &#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1077;&#1081;, &#1095;&#1077;&#1084; JavaScript &#1082;&#1086;&#1076;. &#1055;&#1088;&#1080;&#1074;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1089;&#1086;&#1089;&#1090;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099; &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; Windows &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1080;&#1079;&#1076;&#1072;&#1085;&#1080;&#1081;, &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; Windows 10 RTM TH1. &#1054;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1074;&#1085;&#1086;&#1089;&#1080;&#1084;&#1099;&#1077; &#1074; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1080;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103;&#1093; Windows 10 &#1074;&#1099;&#1085;&#1091;&#1078;&#1076;&#1072;&#1083;&#1080; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1072;&#1079; &#1087;&#1077;&#1088;&#1077;&#1076;&#1077;&#1083;&#1099;&#1074;&#1072;&#1090;&#1100; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1089; &#1094;&#1077;&#1083;&#1100;&#1102; &#1087;&#1086;&#1074;&#1099;&#1096;&#1077;&#1085;&#1080;&#1103; &#1077;&#1075;&#1086; &#1085;&#1072;&#1076;&#1077;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1093;&#1086;&#1090;&#1103; &#1080; &#1094;&#1077;&#1085;&#1086;&#1081; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1087;&#1086;&#1090;&#1077;&#1088;&#1080; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1080;. </span>
</p><p class="c4 c5"><span class="c26"></span></p><p class="c4 c5"><span></span></p><p class="c4">
<span class="c11 c16">&#1042;&#1089;&#1090;&#1091;&#1087;&#1083;&#1077;&#1085;&#1080;&#1077;.</span></p>
<p class="c4"><span class="c11 c16">&nbsp;</span></p><p class="c4"><span>&#1051;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1090;&#1086;&#1084;&#1072; &#1083;&#1077;&#1078;&#1072;&#1090; &#1074; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1083;&#1102;&#1073;&#1086;&#1081; &#1054;&#1057;. &#1044;&#1086; &#1090;&#1077;&#1093; &#1087;&#1086;&#1088;, &#1087;&#1086;&#1082;&#1072; &#1085;&#1077;&#1090; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1090;&#1086;&#1084;&#1086;&#1074;, &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1085;&#1077;&#1075;&#1076;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100;. &#1055;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1090;&#1086;&#1084;&#1072; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1085;&#1072; &#1092;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1077; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; (&#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1090;&#1086;&#1084;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, Storage#Volume, &#1079;&#1072;&#1095;&#1072;&#1089;&#1090;&#1091;&#1102; &#1085;&#1077; &#1089;&#1086;&#1074;&#1089;&#1077;&#1084; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1080;&#1084;&#1077;&#1085;&#1091;&#1077;&#1084;&#1086;&#1075;&#1086; &#1056;&#1072;&#1079;&#1076;&#1077;&#1083;&#1086;&#1084;, Partition), &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1072;&#1102;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1083;&#1102;&#1073;&#1086;&#1081; &#1054;&#1057;. &#1053;&#1080;&#1078;&#1077; &#1080;&#1079;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; &#1091;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1077;&#1085;&#1080;&#1103; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1090;&#1086;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1082; &#1054;&#1057; Windows, &#1085;&#1086; &#1074; &#1087;&#1086;&#1083;&#1085;&#1086;&#1084; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1080; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072;, &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1085;&#1086;&#1084; &#1085;&#1072; GitHub, &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1054;&#1057;.</span>
</p><p class="c4"><span class="c11 c16">&nbsp;</span></p><p class="c4">
<span class="c11 c16">&#1055;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1099;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1073;&#1072;&#1079;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;.</span>
</p><p class="c4"><span>&nbsp;</span></p>
<p class="c4"><span>&#1042; &#1086;&#1089;&#1085;&#1086;&#1074;&#1091; &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093;, &#1079;&#1072;&#1083;&#1086;&#1078;&#1077;&#1085;&#1099; &#1076;&#1074;&#1072; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1072;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c1 c9"><span>1. &nbsp; &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &ldquo;&#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1081; &#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080;&rdquo; &#1087;&#1086; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084;&#1091;, &ldquo;&#1075;&#1077;&#1085;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084;&#1091;&rdquo; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1091;, &#1087;&#1088;&#1080;&#1086;&#1073;&#1088;&#1077;&#1090;&#1072;&#1077;&#1084;&#1086;&#1084;&#1091; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080;-&#1076;&#1077;&#1090;&#1100;&#1084;&#1080; &#1086;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;-&#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1077;&#1081;.</span></p><p class="c4 c24"><span>&nbsp;</span></p><p class="c1 c9"><span>2. &nbsp; &#1042;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1077; &ldquo;&#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&rdquo; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;, &#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1103; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1086;&#1073; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077;, &#1086;&#1090;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1084; &#1086;&#1090; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103; &#1085;&#1072; &#1086;&#1076;&#1080;&#1085; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100;, &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &ldquo;&#1075;&#1077;&#1085;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072;&rdquo; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1086;&#1090;&#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1081; &#1085;&#1072; &#1086;&#1076;&#1080;&#1085; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1086;&#1090; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103;, &#1087;&#1088;&#1080;&#1086;&#1073;&#1088;&#1077;&#1090;&#1072;&#1077;&#1090; &#1094;&#1077;&#1083;&#1099;&#1081; &#1088;&#1103;&#1076; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;, &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1102;&#1097;&#1080;&#1093; &#1077;&#1075;&#1086; &#1086;&#1090; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1087;&#1086;&#1088;&#1086;&#1078;&#1076;&#1077;&#1085;&#1085;&#1099;&#1093; &#1090;&#1077;&#1084; &#1078;&#1077; &#1089;&#1072;&#1084;&#1099;&#1084; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1077;&#1084;, &#1082;&#1072;&#1082;-&#1090;&#1086;: &#1076;&#1072;&#1090;&#1072; &#1080; &#1074;&#1088;&#1077;&#1084;&#1103; &#1088;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;, &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1100;&#1085;&#1099;&#1081; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;, &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1095;&#1080;&#1089;&#1083;&#1086;&#1074;&#1086;&#1081; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;, &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086;&#1077;, &#1086;&#1073;&#1086;&#1073;&#1097;&#1077;&#1085;&#1085;&#1086;&#1077; &#1080;&#1084;&#1103;, &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1089;&#1090;&#1080;&#1082;&#1080;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; &#1086;&#1073;&#1098;&#1077;&#1084;&#1086;&#1084; &#1093;&#1088;&#1072;&#1085;&#1080;&#1084;&#1099;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1076;&#1088;. &nbsp;</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1042;&#1086; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1083;&#1083;&#1080;&#1079;&#1080;&#1081; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1087;&#1086;&#1103;&#1074;&#1103;&#1090;&#1089;&#1103; &#1076;&#1074;&#1072; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1089; &#1072;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1086; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;&#1084;&#1080; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1072;&#1084;&#1080;, &#1087;&#1088;&#1080;&#1089;&#1074;&#1086;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103;&#1084;&#1080; &#1086;&#1073;&#1086;&#1088;&#1091;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1082; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084;&#1091; &#1090;&#1072;&#1082;&#1086;&#1084;&#1091; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1091; &#1087;&#1088;&#1080; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;, &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &ldquo;&#1073;&#1080;&#1088;&#1082;&#1072; &#1089; &#1085;&#1086;&#1084;&#1077;&#1088;&#1086;&#1084;&rdquo;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span class="c11 c16">&#1048;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1103; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103;&#1084;&#1080; &#1086;&#1073;&#1086;&#1088;&#1091;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1084;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1084;&#1080;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1055;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1080; &#1086;&#1073;&#1086;&#1088;&#1091;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1072;&#1102;&#1097;&#1080;&#1077; &#1078;&#1077;&#1089;&#1090;&#1082;&#1080;&#1077; &#1076;&#1080;&#1089;&#1082;&#1080;, &#1092;&#1083;&#1101;&#1096;-&#1085;&#1072;&#1082;&#1086;&#1087;&#1080;&#1090;&#1077;&#1083;&#1080;, DVD &#1080; CD &#1085;&#1072;&#1082;&#1086;&#1087;&#1080;&#1090;&#1077;&#1083;&#1080; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1087;&#1086;&#1076;&#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; (&#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1077;, &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1077;, &#1074;&#1080;&#1088;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077;, &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103;, &#1076;&#1083;&#1103; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103; &#1080; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;, &#1089; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;), &#1053;&#1072;&#1082;&#1086;&#1087;&#1080;&#1090;&#1077;&#1083;&#1080; &#1085;&#1072; &#1084;&#1072;&#1075;&#1085;&#1080;&#1090;&#1085;&#1086;&#1081; &#1083;&#1077;&#1085;&#1090;&#1077;, &#1060;&#1083;&#1086;&#1087;&#1087;&#1080;-&#1076;&#1080;&#1089;&#1082;&#1086;&#1074;&#1086;&#1076;&#1099;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1055;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1080; &#1086;&#1073;&#1086;&#1088;&#1091;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; (Manufactures), &#1085;&#1072;&#1076;&#1077;&#1083;&#1103;&#1102;&#1090; &#1089;&#1074;&#1086;&#1080; &#1080;&#1079;&#1076;&#1077;&#1083;&#1080;&#1103; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;, &#1085;&#1077;&#1091;&#1085;&#1080;&#1095;&#1090;&#1086;&#1078;&#1080;&#1084;&#1099;&#1084; &#1080; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084; &#1089; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1072; &#1085;&#1072; &#1074;&#1089;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1078;&#1080;&#1079;&#1085;&#1080;, &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1084;. &#1048;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;, &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &ldquo;PnPDeviceID&rdquo;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1076;&#1083;&#1080;&#1085;&#1085;&#1086;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1081;, &#1088;&#1072;&#1079;&#1073;&#1080;&#1090;&#1086;&#1081; &#1085;&#1072; &#1087;&#1086;&#1076;&#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1084; &ldquo;&amp;&rdquo;. &#1055;&#1086;&#1076;&#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1080;&#1084;&#1103; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103;, &#1085;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079;&#1076;&#1077;&#1083;&#1080;&#1103;, &#1085;&#1086;&#1084;&#1077;&#1088; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080;, &#1082;&#1083;&#1072;&#1089;&#1089; &#1080;&#1079;&#1076;&#1077;&#1083;&#1080;&#1103; &#1080; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1050;&#1072;&#1082; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1083;&#1102;&#1073;&#1086;&#1077; &#1080;&#1079; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074;&#1087;&#1077;&#1088;&#1074;&#1099;&#1077; &#1073;&#1099;&#1083;&#1086; &#1086;&#1087;&#1086;&#1079;&#1085;&#1072;&#1085;&#1086; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1077; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; (&#1079;&#1072; &#1086;&#1076;&#1085;&#1080;&#1084; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084;), &#1087;&#1088;&#1080;&#1086;&#1073;&#1088;&#1077;&#1090;&#1072;&#1077;&#1090; &#1077;&#1097;&#1077; &#1086;&#1076;&#1080;&#1085; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081;, &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1080;&#1081; &#1080; &#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;, &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; GUID. &#1044;&#1083;&#1080;&#1085;&#1072; GUID &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; 42 ASCII-&#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072; &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; 6 &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1089;&#1083;&#1091;&#1078;&#1077;&#1073;&#1085;&#1099;&#1084;&#1080;. &#1042; &#1089;&#1074;&#1103;&#1079;&#1080; &#1089; &#1101;&#1090;&#1080;&#1084; &#1079;&#1085;&#1072;&#1095;&#1080;&#1084;&#1099;&#1084;&#1080; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1083;&#1080;&#1096;&#1100; 32 16-&#1088;&#1080;&#1095;&#1085;&#1099;&#1093; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072;, &#1085;&#1077;&#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086; &#1087;&#1088;&#1077;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081; &#1074; 8-&#1084;&#1080; &#1073;&#1072;&#1081;&#1090;&#1085;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086;, QWORD, &#1087;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1084;&#1091; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1091;. &#1069;&#1090;&#1080; &#1074;&#1086;&#1089;&#1100;&#1084;&#1080;&#1073;&#1072;&#1081;&#1090;&#1085;&#1099;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072; &#1093;&#1077;&#1096;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1076;&#1072;&#1083;&#1077;&#1077; &#1076;&#1083;&#1103; &ldquo;&#1087;&#1088;&#1103;&#1084;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;&rdquo; &#1082; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084; &#1080; &#1076;&#1083;&#1103; &#1091;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1087;&#1091;&#1090;&#1077;&#1084; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1081;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span class="c11">&#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;.</span><span>&nbsp;&#1050;&#1072;&#1082; &#1084;&#1080;&#1085;&#1080;&#1084;&#1091;&#1084; &#1086;&#1076;&#1085;&#1080;&#1084; &#1080;&#1079; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084;&#1091; &#1085;&#1077; &#1087;&#1088;&#1080;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; GUID, &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074; &#1089; &#1086;&#1073;&#1086;&#1073;&#1097;&#1077;&#1085;&#1085;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &ldquo;DVD-ROM&rdquo;, &#1086;&#1073;&#1089;&#1083;&#1091;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; &#1054;&#1057; Windows &#1083;&#1102;&#1073;&#1099;&#1093; &#1080;&#1079;&#1076;&#1072;&#1085;&#1080;&#1081; &#1080; &#1088;&#1077;&#1076;&#1072;&#1082;&#1094;&#1080;&#1081; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1086;&#1084; &ldquo;cdrom&rdquo;, </span><span class="c12">HKLM\SYSTEM\CurrentControlClass\Services\cdrom\Enum.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1044;&#1083;&#1103; &#1090;&#1072;&#1082;&#1080;&#1093; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074; &#1087;&#1088;&#1080;&#1089;&#1074;&#1086;&#1077;&#1085;&#1085;&#1099;&#1081; &#1054;&#1057; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; PnPDeviceID &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1084; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span class="c11 c16">&#1056;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1083;&#1083;&#1080;&#1079;&#1080;&#1081; &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; &#1054;&#1057; Windows</span><span>.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1054;&#1057; Windows &#1087;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;&#1077;&#1090; &#1090;&#1086;&#1095;&#1085;&#1086; &#1090;&#1072;&#1082; &#1078;&#1077;, &#1085;&#1103;&#1085;&#1077;&#1095;&#1082;&#1080; &#1074; &#1088;&#1086;&#1076;&#1080;&#1083;&#1100;&#1085;&#1099;&#1093; &#1076;&#1086;&#1084;&#1072;&#1093;, &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1099;&#1074;&#1072;&#1103; &#1085;&#1077;&#1082;&#1091;&#1102; &#1073;&#1080;&#1088;&#1082;&#1091; &#1082; &#1088;&#1091;&#1082;&#1077; &#1085;&#1086;&#1074;&#1086;&#1088;&#1086;&#1078;&#1076;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086;: &#1054;&#1057; &#1087;&#1088;&#1080;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1082; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1091; &#1086;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103; &#1077;&#1097;&#1077; &#1080; &ldquo;&#1073;&#1080;&#1088;&#1082;&#1091; &#1089; &#1085;&#1086;&#1084;&#1077;&#1088;&#1086;&#1084;&rdquo; &#1085;&#1072; &#1090;&#1086;&#1090; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;, &#1077;&#1089;&#1083;&#1080; &#1054;&#1057; &#1087;&#1088;&#1080;&#1076;&#1077;&#1090;&#1089;&#1103; &#1086;&#1087;&#1086;&#1079;&#1085;&#1072;&#1074;&#1072;&#1090;&#1100; &#1080; &#1087;&#1088;&#1080;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1090;&#1100; PnPDeviceID &#1077;&#1097;&#1077; &#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1086;&#1084;&#1091; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1091; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086; &#1078;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103;. &#1069;&#1090;&#1072; &laquo;&#1073;&#1080;&#1088;&#1082;&#1072; &#1089; &#1085;&#1086;&#1084;&#1077;&#1088;&#1086;&#1084;&rdquo; &#1087;&#1088;&#1080;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1095;&#1077;&#1088;&#1077;&#1079; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100; &ldquo;&amp;&rdquo; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1081;. &#1058;&#1077;&#1084; &#1089;&#1072;&#1084;&#1099;&#1084; &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1085;&#1077;&#1090; &#1076;&#1074;&#1091;&#1093; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074; &#1089; &#1072;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1086; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;&#1084;&#1080; PnPDeviceID.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>PnPDeviceID &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1072;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1086; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1074;&#1087;&#1077;&#1088;&#1074;&#1099;&#1077; &#1086;&#1087;&#1086;&#1079;&#1085;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081;. &#1053;&#1086; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;, &#1086;&#1090;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1086;&#1090; &ldquo;DVD-ROM&rdquo;, &#1082;&#1072;&#1082; &#1091;&#1078;&#1077; &#1073;&#1099;&#1083;&#1086; &#1089;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1074;&#1099;&#1096;&#1077;, &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1077;&#1097;&#1077; &#1080; GUID. &#1050;&#1072;&#1082; &#1078;&#1077; &#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; GUID &#1076;&#1083;&#1103; &#1076;&#1074;&#1091;&#1093; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074; &#1089; &#1072;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1086; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;&#1084;&#1080; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1072;&#1084;&#1080; &#1086;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103;, &#1082;&#1091;&#1076;&#1072; &#1074;&#1077;&#1096;&#1072;&#1077;&#1090;&#1089;&#1103; &ldquo;&#1073;&#1080;&#1088;&#1082;&#1072; &#1089; &#1085;&#1086;&#1084;&#1077;&#1088;&#1086;&#1084;&rdquo; &#1074; GUID?</span></p><p class="c4"><span>&#1054;&#1090;&#1074;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081;: &ldquo;&#1073;&#1080;&#1088;&#1082;&#1072; &#1089; &#1085;&#1086;&#1084;&#1077;&#1088;&#1086;&#1084;&rdquo; &#1101;&#1090;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1076;&#1074;&#1072; 16-&#1088;&#1080;&#1095;&#1085;&#1099;&#1093; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1103; GUID. &#1041;&#1086;&#1083;&#1077;&#1077; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1087;&#1086;&#1103;&#1089;&#1085;&#1077;&#1085;&#1080;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1072;&#1085;&#1086; &#1085;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1080; &#1086;&#1090;&#1095;&#1077;&#1090;&#1086;&#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; 8.1 &#1080; Windows 10 RTM TH1.</span></p><p class="c4"><span class="c11 c16">&nbsp;</span></p><p class="c4"><span class="c11 c16">&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.</span></p><p class="c4"><span class="c11 c16">&nbsp;</span></p><p class="c4"><span class="c11">&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1082; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1090;&#1086;&#1084;&#1072;&#1084;:</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span class="c17">&#1057;&#1077;&#1088;&#1080;&#1081;&#1085;&#1099;&#1081; &#1085;&#1086;&#1084;&#1077;&#1088; &#1090;&#1086;&#1084;&#1072;, SerialNumber</span><span>. &#1055;&#1088;&#1080;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1054;&#1057; &#1072;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1086; &#1074;&#1089;&#1077;&#1084; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1090;&#1086;&#1084;&#1072;&#1084;, &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; &#1076;&#1072;&#1078;&#1077; &#1074;&#1080;&#1088;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &ldquo;DVD-ROM&rdquo;. &#1057;&#1077;&#1088;&#1080;&#1081;&#1085;&#1099;&#1081; &#1085;&#1086;&#1084;&#1077;&#1088; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; 8 16-&#1090;&#1080;&#1088;&#1080;&#1095;&#1085;&#1099;&#1084;&#1080; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072;&#1084;&#1080;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1087;&#1086;&#1083;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099; &#1082;&#1086;&#1083;&#1083;&#1080;&#1079;&#1080;&#1080;, &#1086;&#1090; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1085;&#1077; &#1087;&#1099;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1101;&#1090;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1085;&#1077;&#1090; &#1074; &#1090;&#1086;&#1084; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;. &#1057;&#1077;&#1088;&#1080;&#1081;&#1085;&#1099;&#1081; &#1085;&#1086;&#1084;&#1077;&#1088; &ldquo;00000000&rdquo; &#1087;&#1088;&#1080;&#1086;&#1073;&#1088;&#1077;&#1090;&#1072;&#1102;&#1090; &#1074;&#1089;&#1077; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1090;&#1086;&#1084;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1099;&#1083;&#1080; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1079;&#1072;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; (Encrypted) &#1090;&#1077;&#1084; &#1080;&#1083;&#1080; &#1080;&#1085;&#1099;&#1084; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1084;, &#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1089;&#1077;&#1088;&#1080;&#1081;&#1085;&#1099;&#1081; &#1085;&#1086;&#1084;&#1077;&#1088; &#1090;&#1086;&#1084;&#1072; &#1076;&#1086; &#1090;&#1077;&#1093; &#1087;&#1086;&#1088;, &#1087;&#1086;&#1082;&#1072; &#1090;&#1086;&#1084; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1084;&#1086;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1077;&#1084; &#1082;&#1086;&#1076;&#1072; &#1076;&#1077;&#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; 8 &#1085;&#1091;&#1083;&#1077;&#1081; &#1074; &#1087;&#1086;&#1083;&#1077; SerialNumber &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1090;&#1086;&#1084;&#1072; &#1091;&#1074;&#1077;&#1088;&#1077;&#1085;&#1085;&#1086; &#1089;&#1074;&#1080;&#1076;&#1077;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086;&#1090; &#1090;&#1086;&#1084; &#1079;&#1072;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span class="c11">&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1082; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;:</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span class="c17">&#1057;&#1077;&#1088;&#1080;&#1081;&#1085;&#1099;&#1081; &#1085;&#1086;&#1084;&#1077;&#1088; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;, SerialNumber</span><span>. &#1055;&#1088;&#1080;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1077;&#1084; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;. 8 16-&#1088;&#1080;&#1095;&#1085;&#1099;&#1093; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074;. &#1061;&#1088;&#1072;&#1085;&#1080;&#1090;&#1089;&#1103; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1076;&#1072;&#1078;&#1077; &#1076;&#1083;&#1103; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;, &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1090;&#1086;&#1084; &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1073;&#1099;&#1083; &#1090;&#1077;&#1084; &#1080;&#1083;&#1080; &#1080;&#1085;&#1099;&#1084; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1084; &#1079;&#1072;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span class="c17">&#1055;&#1086;&#1076;&#1087;&#1080;&#1089;&#1100; &#1076;&#1080;&#1089;&#1082;&#1072;, Signature</span><span>. &#1055;&#1088;&#1080;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1077;&#1084; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;. 8 16-&#1088;&#1080;&#1095;&#1085;&#1099;&#1093; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074;.</span></p><p class="c4"><span>&#1042;&#1089;&#1077; &#1054;&#1057; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1091;&#1102;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1080; &#1076;&#1080;&#1089;&#1082;&#1072; &#1074; &#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1085;&#1072; &#1076;&#1080;&#1089;&#1082;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1099; Gpt-&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1099;. &#1069;&#1090;&#1086; &#1085;&#1077;&#1089;&#1086;&#1084;&#1085;&#1077;&#1085;&#1085;&#1086; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1081; &#1090;&#1088;&#1102;&#1082;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1073;&#1077;&#1079; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1085;&#1080;&#1079;&#1082;&#1086;&#1091;&#1088;&#1086;&#1074;&#1085;&#1077;&#1074;&#1099;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1074;&#1074;&#1086;&#1076;&#1072;-&#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1076;&#1083;&#1103; &#1076;&#1080;&#1089;&#1082;&#1072;, &#1087;&#1086; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1102; &#1080;&#1083;&#1080; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1080;&#1102; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1080; &#1076;&#1080;&#1089;&#1082;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1057;&#1090;&#1080;&#1083;&#1100; (Style) &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1086;&#1074; &#1085;&#1072; &#1076;&#1080;&#1089;&#1082;&#1077;: Mbr/Gpt. &#1054;&#1095;&#1077;&#1085;&#1100; &#1080;&#1079;&#1103;&#1097;&#1085;&#1086; &#1101;&#1090;&#1086; &#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1093; &#1076;&#1080;&#1089;&#1082;&#1072;, &#1093;&#1088;&#1072;&#1085;&#1080;&#1084;&#1099;&#1093; &#1074; </span><span class="c12">HKLM\HARDWARE\DESCRIPTION\System\MultifunctionAdapter\0\DiskController\0\DiskPeripheral</span><span>, &#1075;&#1076;&#1077; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1089;&#1103; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &quot;Identifier&quot;=&quot;9cb5ff90-00000000-A&quot;. 8 &#1085;&#1091;&#1083;&#1077;&#1081;, &#1085;&#1077;&#1089;&#1086;&#1084;&#1085;&#1077;&#1085;&#1085;&#1086; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1093; &#1054;&#1057; &#1085;&#1072; &#1084;&#1077;&#1089;&#1090;&#1086; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1080; &#1076;&#1080;&#1089;&#1082;&#1072;, &#1089;&#1074;&#1080;&#1076;&#1077;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1099; &#1085;&#1072; &#1076;&#1080;&#1089;&#1082;&#1077; &#1080;&#1084;&#1077;&#1102;&#1090; &#1089;&#1090;&#1080;&#1083;&#1100; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; Gpt.</span></p><p class="c4 c5"><span></span></p><p class="c4"><span class="c11 c16">&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1076; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; Windows.</span></p><p class="c4"><span class="c11 c16">&nbsp;</span></p><a href="#" name="e500d9ad8da17193fd014350287702655b07cb5e"></a><a href="#" name="0"></a><table cellpadding="0" cellspacing="0" class="c25"><tbody><tr class="c23"><td class="c28" colspan="3" rowspan="1"><p class="c7"><span class="c6">Windows 10 RTM TH1 Build 10240</span></p></td></tr><tr class="c23"><td class="c8" colspan="1" rowspan="1"><p class="c7"><span class="c6">N</span></p></td><td class="c2" colspan="1" rowspan="1"><p class="c7"><span class="c6">EnumDevicesAndVolumes.wsf</span></p></td>
<td class="c15" colspan="1" rowspan="1"><p class="c7"><span class="c6">DISKPART.EXE</span></p></td></tr><tr class="c23"><td class="c8" colspan="1" rowspan="1"><p class="c7"><span class="c6">1</span></p></td><td class="c2" colspan="1" rowspan="1"><p class="c7"><span class="c20">2.140</span></p></td><td class="c15" colspan="1" rowspan="1"><p class="c7"><span class="c6">6.235</span></p></td></tr><tr class="c23"><td class="c8" colspan="1" rowspan="1"><p class="c7"><span class="c6">2</span></p></td><td class="c2" colspan="1" rowspan="1"><p class="c7"><span class="c20">1.452</span></p></td><td class="c15" colspan="1" rowspan="1"><p class="c7"><span class="c6">2.936</span></p></td></tr><tr class="c23"><td class="c8" colspan="1" rowspan="1"><p class="c7"><span class="c6">3</span></p></td><td class="c2" colspan="1" rowspan="1"><p class="c7"><span class="c20">2.530</span></p></td><td class="c15" colspan="1" rowspan="1"><p class="c7"><span class="c6">2.953</span></p></td></tr><tr class="c23"><td class="c8" colspan="1" rowspan="1"><p class="c7"><span class="c6">4</span></p></td><td class="c2" colspan="1" rowspan="1"><p class="c7"><span class="c20">2.541</span></p></td><td class="c15" colspan="1" rowspan="1"><p class="c7"><span class="c6">2.867</span></p></td></tr><tr class="c23"><td class="c8" colspan="1" rowspan="1"><p class="c7"><span class="c6">5</span></p></td><td class="c2" colspan="1" rowspan="1"><p class="c7"><span class="c20">1.448</span></p></td><td class="c15" colspan="1" rowspan="1"><p class="c7"><span class="c6">2.905</span></p></td></tr></tbody></table><p class="c4"><span class="c11 c16">&nbsp;</span></p><a href="#" name="5662872f9f08976c03760a95fbd16842c23913e1"></a><a href="#" name="1"></a><table cellpadding="0" cellspacing="0" class="c25"><tbody><tr class="c23"><td class="c28" colspan="3" rowspan="1"><p class="c7"><span class="c6">Windows 8.1 Build 9600</span></p></td></tr><tr class="c23"><td class="c8" colspan="1" rowspan="1"><p class="c7"><span class="c6">N</span></p></td><td class="c2" colspan="1" rowspan="1"><p class="c7"><span class="c6">EnumDevicesAndVolumes.wsf</span></p></td><td class="c15" colspan="1" rowspan="1"><p class="c7"><span class="c6">DISKPART.EXE</span></p></td></tr><tr class="c23"><td class="c8" colspan="1" rowspan="1"><p class="c7"><span class="c6">1</span></p></td><td class="c2" colspan="1" rowspan="1"><p class="c7"><span class="c20">1.243</span></p></td><td class="c15" colspan="1" rowspan="1"><p class="c7"><span class="c6">5.274</span></p></td></tr><tr class="c23"><td class="c8" colspan="1" rowspan="1"><p class="c7"><span class="c6">2</span></p></td><td class="c2" colspan="1" rowspan="1"><p class="c7"><span class="c20">1.222</span></p></td><td class="c15" colspan="1" rowspan="1"><p class="c7"><span class="c6">2.558</span></p></td></tr><tr class="c23"><td class="c8" colspan="1" rowspan="1"><p class="c7"><span class="c6">3</span></p></td><td class="c2" colspan="1" rowspan="1"><p class="c7"><span class="c20">1.218</span></p></td><td class="c15" colspan="1" rowspan="1"><p class="c7"><span class="c6">1.289</span></p></td></tr><tr class="c23"><td class="c8" colspan="1" rowspan="1"><p class="c7"><span class="c6">4</span></p></td><td class="c2" colspan="1" rowspan="1"><p class="c7"><span class="c20">1.200</span></p></td><td class="c15" colspan="1" rowspan="1"><p class="c7"><span class="c6">1.379</span></p></td></tr><tr class="c23"><td class="c8" colspan="1" rowspan="1"><p class="c7"><span class="c6">5</span></p></td><td class="c2" colspan="1" rowspan="1"><p class="c7"><span class="c20">1.379</span></p></td><td class="c15" colspan="1" rowspan="1"><p class="c7"><span class="c6">1.425</span></p></td></tr></tbody></table><p class="c4"><span class="c11 c16">&nbsp;</span></p><a href="#" name="77b3e175294f18876914a9fbaaf9930762e30caf"></a><a href="#" name="2"></a><table cellpadding="0" cellspacing="0" class="c25"><tbody><tr class="c23"><td class="c28" colspan="3" rowspan="1"><p class="c7"><span class="c6">Windows 7 SP1 Build 7601</span></p></td></tr><tr class="c23"><td class="c8" colspan="1" rowspan="1"><p class="c7"><span class="c6">N</span></p></td><td class="c2" colspan="1" rowspan="1"><p class="c7"><span class="c6">EnumDevicesAndVolumes.wsf</span></p></td><td class="c15" colspan="1" rowspan="1"><p class="c7"><span class="c6">DISKPART.EXE</span></p></td></tr><tr class="c23"><td class="c8" colspan="1" rowspan="1"><p class="c7"><span class="c6">1</span></p></td><td class="c2" colspan="1" rowspan="1"><p class="c7"><span class="c20">1.406</span></p></td><td class="c15" colspan="1" rowspan="1"><p class="c7"><span class="c6">11.913</span></p></td></tr><tr class="c23"><td class="c8" colspan="1" rowspan="1"><p class="c7"><span class="c6">2</span></p></td><td class="c2" colspan="1" rowspan="1"><p class="c7"><span class="c20">1.319</span></p></td><td class="c15" colspan="1" rowspan="1"><p class="c7"><span class="c6">2.130</span></p></td></tr><tr class="c23"><td class="c8" colspan="1" rowspan="1"><p class="c7"><span class="c6">3</span></p></td><td class="c2" colspan="1" rowspan="1"><p class="c7"><span class="c20">1.338</span></p></td><td class="c15" colspan="1" rowspan="1"><p class="c7"><span class="c6">2.662</span></p></td></tr><tr class="c23"><td class="c8" colspan="1" rowspan="1"><p class="c7"><span class="c6">4</span></p></td><td class="c2" colspan="1" rowspan="1"><p class="c7"><span class="c20">1.310</span></p></td><td class="c15" colspan="1" rowspan="1"><p class="c7"><span class="c6">2.788</span></p></td></tr><tr class="c23"><td class="c8" colspan="1" rowspan="1"><p class="c7"><span class="c6">5</span></p></td><td class="c2" colspan="1" rowspan="1"><p class="c7"><span class="c20">1.287</span></p></td><td class="c15" colspan="1" rowspan="1"><p class="c7"><span class="c6">2.698</span></p></td></tr></tbody></table><p class="c4"><span class="c11 c16">&nbsp;</span></p><p class="c4"><span>&#1053;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1087;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1091; JavaScript &#1082;&#1086;&#1076;, WhoIsFaster.js, &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1083; &#1085;&#1072; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; (WShell.Exec) &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1099;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1102; </span><span class="c16">EnumDevicesAndVolumes.wsf &#1080; DISKPART.EXE. &#1042; &#1093;&#1086;&#1076;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1090;&#1086;&#1081; &#1080; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;, &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1084;&#1080; &#1085;&#1072; StdOut &#1080; &#1089;&#1095;&#1080;&#1090;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;, &#1073;&#1091;&#1092;&#1077;&#1088;&#1080;&#1079;&#1086;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1089; &#1094;&#1077;&#1083;&#1100;&#1102; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086; &#1090;&#1086;&#1095;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1088;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1085;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1076;&#1072;. &#1047;&#1072;&#1084;&#1077;&#1088;&#1099; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1083;&#1080;&#1089;&#1100; &#1089; &#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1076;&#1086; &#1084;&#1080;&#1083;&#1083;&#1080;&#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1099; &#1080; &#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072;&#1093; &#1074;&#1089;&#1102;&#1076;&#1091; &#1092;&#1080;&#1075;&#1091;&#1088;&#1080;&#1088;&#1091;&#1102;&#1090; &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1099; &#1080; &#1084;&#1080;&#1083;&#1083;&#1080;&#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1099;. </span></p><p class="c4 c5"><span class="c16"></span></p><p class="c4"><span class="c16">&#1050; &#1089;&#1086;&#1078;&#1072;&#1083;&#1077;&#1085;&#1080;&#1102;, &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1094;&#1080;&#1092;&#1088;&#1099; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1102;&#1090; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1085;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;: EnumDevicesAndVolumes.wsf &#1087;&#1086; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1102; &#1089;&#1074;&#1086;&#1077;&#1081; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1080; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1074;&#1089;&#1077;&#1093; &#1086;&#1090;&#1095;&#1077;&#1090;&#1086;&#1074;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1083; &#1074; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080; &#1077;&#1097;&#1077; &#1080; &#1074;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1092;&#1072;&#1081;&#1083;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1081; &#1074; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; DISKPART.EXE. &#1058;&#1072;&#1082; &#1095;&#1090;&#1086; &#1082; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1085;&#1086;&#1084;&#1091; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1086;&#1073;&#1077;&#1080;&#1084;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1084;&#1080; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1077;&#1097;&#1077; &#1080; &#1074;&#1088;&#1077;&#1084;&#1103;, &#1079;&#1072;&#1090;&#1088;&#1072;&#1095;&#1077;&#1085;&#1085;&#1086;&#1077; &#1085;&#1072; &#1076;&#1080;&#1089;&#1082;&#1086;&#1074;&#1099;&#1081; &#1074;&#1074;&#1086;&#1076;-&#1074;&#1099;&#1074;&#1086;&#1076;. &#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1074;&#1088;&#1077;&#1084;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1085;&#1072; &#1076;&#1080;&#1089;&#1082; &#1079;&#1072;&#1074;&#1077;&#1076;&#1086;&#1084;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;, &#1095;&#1077;&#1084; &#1074;&#1088;&#1077;&#1084;&#1103; &#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1090;&#1086; &#1087;&#1086; &#1101;&#1090;&#1086;&#1084;&#1091; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1091; DISKPART.EXE &#1080;&#1084;&#1077;&#1083; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1087;&#1088;&#1077;&#1080;&#1084;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;.</span></p><p class="c4 c5"><span></span></p><p class="c4"><span class="c11 c16">&#1040;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1072;&#1103; &#1087;&#1083;&#1072;&#1090;&#1092;&#1086;&#1088;&#1084;&#1072;.</span></p><p class="c4"><span class="c11 c16">&nbsp;</span></p><p class="c4"><span>Thinkpad R500, 2.4Gz, 8 Gb RAM, ATI Mobility Radeon HD 3400, 1650x1080, &#1076;&#1074;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1093; &#1076;&#1080;&#1089;&#1082;&#1072;. &#1055;&#1077;&#1088;&#1074;&#1099;&#1081;, &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &ndash; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100; &#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; 7200, &#1095;&#1077;&#1090;&#1099;&#1088;&#1077; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072;.</span></p><p class="c4"><span>&#1042;&#1090;&#1086;&#1088;&#1086;&#1081; &#1076;&#1080;&#1089;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1074; &#1090;&#1088;&#1077;&#1077; &#1076;&#1083;&#1103; DVD-ROM, &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100; &#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; 5400, &#1076;&#1074;&#1072; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span class="c11 c16">&#1055;&#1088;&#1080;&#1082;&#1083;&#1072;&#1076;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1074; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;&#1093; Windows.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>Windows 7 Enterprise Evaluation. &#1055;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &ldquo;&#1087;&#1091;&#1089;&#1090;&#1072;&rdquo;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099; &#1083;&#1080;&#1096;&#1100; Total Commander &#1080; Free Javascript Editor. &#1069;&#1090;&#1080; &#1078;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099; &#1080; &#1074; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1093;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>Windows 8.1: MS Office 2013, Acronis &nbsp;True Image 2015, Acronis Disk Director 12, &#1087;&#1072;&#1088;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084; &#1086;&#1090; AOMEI &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1073;&#1101;&#1082;&#1072;&#1087;&#1086;&#1074; &#1080; &#1076;&#1083;&#1103; &#1086;&#1073;&#1089;&#1083;&#1091;&#1078;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1086;&#1074;. &#1055;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1099; &#1083;&#1080;&#1096;&#1100; &#1090;&#1077; &#1080;&#1079; &#1087;&#1088;&#1080;&#1082;&#1083;&#1072;&#1076;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1102;&#1090; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;-&#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1099;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1097;&#1080;&#1077; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074; HKLM\SYSTEM\CurrentControlSet\Services.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>Windows 10: &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089; Technical Preview Build 10049, &#1082;&#1086;&#1075;&#1076;&#1072; &#1089;&#1090;&#1072;&#1083;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1084; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; Windows 8.1 &#1073;&#1077;&#1079; &#1087;&#1086;&#1090;&#1077;&#1088;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080;&#1082;&#1083;&#1072;&#1076;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084; &#1080; &#1080;&#1093; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082;, &#1072;&#1082;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1085;&#1072; &#1090;&#1086;&#1090; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; 8.1 &#1073;&#1099;&#1083;&#1072; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1072;. &#1042; &#1076;&#1072;&#1083;&#1100;&#1085;&#1077;&#1081;&#1096;&#1077;&#1084; Windows 10 &#1087;&#1088;&#1077;&#1090;&#1077;&#1088;&#1087;&#1077;&#1074;&#1072;&#1083;&#1072; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074;&#1089;&#1077;&#1084;&#1080; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1084;&#1099;&#1084;&#1080; &#1089;&#1073;&#1086;&#1088;&#1082;&#1072;&#1084;&#1080; &#1080; &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074; &#1087;&#1088;&#1080;&#1082;&#1083;&#1072;&#1076;&#1085;&#1086;&#1075;&#1086; &#1089;&#1086;&#1092;&#1090;&#1072; &#1074; &#1089;&#1088;&#1077;&#1076;&#1072;&#1093; 9600 &#1080; 10240, &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1077;&#1090;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4 c5"><span class="c11 c16"></span></p><p class="c4 c5"><span class="c11 c16"></span></p><p class="c4 c5"><span class="c11 c16"></span></p><p class="c4"><span class="c11 c16">&#1048;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1094;&#1080;&#1103; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1074;.</span></p><p class="c4"><span class="c11 c16">&nbsp;</span></p><p class="c4"><span>&#1057;&#1086;&#1088;&#1077;&#1074;&#1085;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099; &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; &#1089;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1085;&#1086; &ldquo;&#1087;&#1091;&#1089;&#1090;&#1086;&#1081;&rdquo; Windows 7 Enterprise Evaluation, &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1091;&#1089;&#1090;&#1091;&#1087;&#1072;&#1102;&#1097;&#1080;&#1077; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1099;&#1084; &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &ldquo;&#1085;&#1072;&#1095;&#1080;&#1085;&#1077;&#1085;&#1085;&#1086;&#1081;&rdquo; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1089; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;-&#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072;&#1084;&#1080;, &#1082;&#1072;&#1082; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;, &#1088;&#1072;&#1079;&#1074;&#1077;&#1080;&#1074;&#1072;&#1102;&#1090; &#1084;&#1080;&#1092; &#1086; &#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1081; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1080; &#1089;&#1077;&#1084;&#1077;&#1088;&#1082;&#1080; &#1074; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1080; &#1089; &#1074;&#1086;&#1089;&#1100;&#1084;&#1077;&#1088;&#1082;&#1086;&#1081;. &#1040;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1099;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; Build 9600, &hellip;,10240 &ndash; &#1087;&#1086;&#1095;&#1090;&#1080; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;. &#1042; &#1089;&#1088;&#1077;&#1076;&#1077; 7601 &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1085;&#1077;&#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1091;&#1089;&#1083;&#1086;&#1078;&#1085;&#1077;&#1085; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089;&#1077;&#1088;&#1074;&#1080;&#1089;&#1072; sff_disk, &#1086;&#1073;&#1089;&#1083;&#1091;&#1078;&#1080;&#1074;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; SD-&#1082;&#1072;&#1088;&#1090;&#1099;, &#1085;&#1086; &#1079;&#1072;&#1090;&#1086; &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; 7601 &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1094;&#1080;&#1082;&#1083; &#1089; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; 4, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1081; &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; 9600+, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1081; &#1076;&#1083;&#1103; &#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1093; &#1076;&#1080;&#1089;&#1082;&#1086;&#1074;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1087;&#1086;&#1076; 7601 &#1101;&#1090;&#1080;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1074; Registry &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1085;&#1077;&#1090;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1063;&#1077;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1080;&#1090;&#1100; &#1086;&#1097;&#1091;&#1090;&#1080;&#1084;&#1086; &#1084;&#1077;&#1085;&#1100;&#1096;&#1091;&#1102; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; DISKPART.EXE &#1074; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1080; &#1089; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084; EnumDevicesAndVolumes.wsf &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; Windows 8.1? &#1045;&#1089;&#1090;&#1100; &#1083;&#1080;&#1096;&#1100; &#1086;&#1076;&#1085;&#1086;, &#1073;&#1077;&#1079;&#1076;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1077;&#1085;&#1080;&#1077;. &#1050;&#1072;&#1082; &#1091;&#1078;&#1077; &#1073;&#1099;&#1083;&#1086; &#1091;&#1087;&#1086;&#1084;&#1103;&#1085;&#1091;&#1090;&#1086;, &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1085;&#1072; &#1085;&#1080;&#1093; &#1090;&#1086;&#1084;&#1072;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1090;&#1086;&#1084;&#1072;&#1093;, &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; QWORD-&#1082;&#1083;&#1102;&#1095;&#1080; (8 &#1073;&#1072;&#1081;&#1090;) &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1093;&#1077;&#1096;-&#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072;&#1084;&#1080;. </span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1054;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1076;&#1083;&#1103; &#1090;&#1077;&#1093; &#1078;&#1077; &#1094;&#1077;&#1083;&#1077;&#1081; &#1083;&#1080;&#1096;&#1100; &#1087;&#1086;&#1083;&#1077; Field 1 GUID, &#1087;&#1088;&#1077;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081; &#1074; QWORD. &#1053;&#1077; &#1093;&#1074;&#1072;&#1090;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1085;&#1080;&#1081; &#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1076;&#1083;&#1103; &#1086;&#1094;&#1077;&#1085;&#1082;&#1080; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1080; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1086;&#1081; &#1093;&#1077;&#1096;-&#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1077;, &#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1072; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1085;&#1077;&#1083;&#1080;&#1085;&#1077;&#1081;&#1085;&#1072;&#1103; &#1080; &#1074; &#1083;&#1091;&#1095;&#1096;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1072; N*log(N), &#1075;&#1076;&#1077; N &ndash; &#1076;&#1083;&#1080;&#1085;&#1072; &#1082;&#1083;&#1102;&#1095;&#1072; &#1074; &#1073;&#1080;&#1090;&#1072;&#1093; &#1080;&#1083;&#1080; &#1073;&#1072;&#1081;&#1090;&#1072;&#1093;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1080;&#1077; &#1082;&#1083;&#1102;&#1095;&#1080;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1084; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1086;&#1084;, &#1084;&#1086;&#1075;&#1091;&#1090; &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1080;&#1090;&#1100; &#1086;&#1090;&#1089;&#1090;&#1072;&#1074;&#1072;&#1085;&#1080;&#1077; DISKPART.EXE.</span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1044;&#1086; &#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; Windows 10 RTM TH1 Build 10240, &#1089;&#1086;&#1088;&#1077;&#1074;&#1085;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099; &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1089;&#1073;&#1086;&#1088;&#1086;&#1082; &#1083;&#1080;&#1096;&#1100; &#1085;&#1077;&#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1083;&#1080;&#1089;&#1100; &#1086;&#1090; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1099;&#1093; &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; 8.1. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080; 10240 &#1073;&#1099;&#1083; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1082;&#1083;&#1102;&#1095;&#1077;&#1081;</span></p><p class="c4"><span>HKU\SID\Software\Microsoft\Windows\CurrentVersion\Explorer\MountPoints2\CPC\Volume: &#1077;&#1089;&#1083;&#1080; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089; 7601 &#1080; &#1079;&#1072;&#1082;&#1072;&#1085;&#1095;&#1080;&#1074;&#1072;&#1103; 10166 &nbsp;&ldquo;&#1076;&#1077;&#1090;&#1080; &#1093;&#1086;&#1076;&#1080;&#1083;&#1080; &#1089;&#1077;&#1084;&#1100;&#1103;&#1084;&#1080;&rdquo;, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1074;&#1089;&#1077; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1090;&#1086;&#1084;&#1072;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1085;&#1072; &#1086;&#1076;&#1085;&#1086;&#1084; &#1080; &#1090;&#1086;&#1084; &#1078;&#1077; &#1092;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1076;&#1080;&#1089;&#1082;&#1077;, &#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1083;&#1080; &#1086;&#1076;&#1080;&#1085; &#1079;&#1072; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1074; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077; &#1074;&#1086;&#1079;&#1088;&#1072;&#1089;&#1090;&#1072;&#1085;&#1080;&#1103; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1076;&#1080;&#1089;&#1082;&#1072;, &#1090;&#1086; &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; 10240 &#1073;&#1099;&#1083;&#1086; &#1074;&#1087;&#1077;&#1088;&#1074;&#1099;&#1077; &#1074;&#1085;&#1077;&#1076;&#1088;&#1077;&#1085;&#1086; &ldquo;&#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077;&rdquo; &#1091;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1077;&#1085;&#1080;&#1077; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1090;&#1086;&#1084;&#1086;&#1074; &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1090;&#1086;&#1084;&#1072; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1074; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077; &#1080;&#1093; &#1084;&#1086;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;. &#1069;&#1090;&#1086;, &#1085;&#1077;&#1089;&#1086;&#1084;&#1085;&#1077;&#1085;&#1085;&#1086; &#1088;&#1077;&#1074;&#1086;&#1083;&#1102;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1091;&#1089;&#1082;&#1086;&#1088;&#1080;&#1090;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1089; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;&#1080; &#1090;&#1086;&#1084;&#1072;&#1084;&#1080;. &#1042;&#1086;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; DISKPART.EXE, &#1082;&#1072;&#1082; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;, &#1077;&#1097;&#1077; &#1085;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1101;&#1090;&#1080;&#1084; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1080; &#1074;&#1089;&#1077; &#1090;&#1072;&#1082;&#1078;&#1077; &#1074;&#1099;&#1090;&#1072;&#1083;&#1082;&#1080;&#1074;&#1072;&#1077;&#1090; &#1074; &#1087;&#1077;&#1088;&#1074;&#1099;&#1077; &#1088;&#1103;&#1076;&#1099; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;, &#1086;&#1073;&#1089;&#1083;&#1091;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1086;&#1084; cdrom.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1089;&#1086;&#1088;&#1077;&#1074;&#1085;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099; &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080; Windows 10 RTM &#1079;&#1072;&#1084;&#1077;&#1090;&#1085;&#1086; &#1093;&#1091;&#1078;&#1077; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1099;&#1093; &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; Windows 8.1 &#1080; &#1085;&#1077; &#1089;&#1090;&#1072;&#1073;&#1080;&#1083;&#1100;&#1085;&#1077;&#1081;. &#1069;&#1090;&#1086;&#1090; &#1092;&#1072;&#1082;&#1090; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1080;&#1090;&#1100; &#1085;&#1077;&#1089;&#1073;&#1072;&#1083;&#1072;&#1085;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1093; &#1089;&#1083;&#1091;&#1078;&#1073;, &#1088;&#1077;&#1079;&#1082;&#1080;&#1084; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1080;&#1093; &#1095;&#1080;&#1089;&#1083;&#1072;, &#1085;&#1077; &#1074;&#1099;&#1083;&#1080;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1076;&#1086; &#1082;&#1086;&#1085;&#1094;&#1072; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072;&#1084;&#1080; &#1082;&#1074;&#1072;&#1085;&#1090;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1074; &#1087;&#1088;&#1080;&#1082;&#1083;&#1072;&#1076;&#1085;&#1099;&#1093; &#1079;&#1072;&#1076;&#1072;&#1095;. &#1042;&#1080;&#1076;&#1080;&#1084;&#1086; &#1087;&#1086;&#1083;&#1085;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1080;&#1093; &#1079;&#1072;&#1076;&#1072;&#1095; &#1077;&#1097;&#1077; &#1074;&#1087;&#1077;&#1088;&#1077;&#1076;&#1080;. &#1042;&#1087;&#1088;&#1086;&#1095;&#1077;&#1084;, &#1074;&#1083;&#1080;&#1103;&#1085;&#1080;&#1077; &#1074;&#1085;&#1077;&#1079;&#1072;&#1087;&#1085;&#1086; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1084;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1093; &#1089;&#1083;&#1091;&#1078;&#1073; &#1079;&#1072;&#1084;&#1077;&#1090;&#1085;&#1086; &#1080; &#1074; &#1089;&#1086;&#1088;&#1077;&#1074;&#1085;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072;&#1093; &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; Windows 8.1.</span></p><p class="c4 c5"><span></span></p><p class="c4"><span class="c11 c16">&#1042;&#1080;&#1079;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1074; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;</span></p><p class="c4 c5"><span></span></p><p class="c4"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 602.00px; height: 313.33px;"><img alt="" src="image04.png" style="width: 602.00px; height: 313.33px; margin-left: 0.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1056;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 1.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1048;&#1084;&#1077;&#1085;&#1085;&#1086; &#1101;&#1090;&#1086;&#1090; &#1074;&#1099;&#1074;&#1086;&#1076; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1086; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1090;&#1086;&#1084;&#1072;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1086;&#1081; DISKPART.EXE &#1080; &#1103;&#1074;&#1080;&#1083;&#1089;&#1103; &ldquo;&#1079;&#1072;&#1076;&#1072;&#1095;&#1077;&#1081; &#1076;&#1083;&#1103; &#1087;&#1086;&#1076;&#1088;&#1072;&#1078;&#1072;&#1085;&#1080;&#1103;&rdquo; &#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;. &#1056;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1085;&#1099;&#1077; &#1085;&#1080;&#1078;&#1077; &#1088;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082;&#1080; 2 &#1080; 3 &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1086;&#1090;&#1095;&#1077;&#1090;&#1086;&#1074;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; EnumDevicesAndVolumes.wsf. &#1069;&#1090;&#1086; &#1089;&#1072;&#1084;&#1099;&#1077; &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1080;&#1077; &#1080;&#1079; &#1074;&#1089;&#1077;&#1093; &#1086;&#1090;&#1095;&#1077;&#1090;&#1086;&#1074;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; EnumDevicesAndVolumes.wsf. &#1058;&#1077;&#1084; &#1085;&#1077; &#1084;&#1077;&#1085;&#1077;&#1077; &#1076;&#1072;&#1078;&#1077; &#1101;&#1090;&#1086;&#1090; &#1086;&#1090;&#1095;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;, &#1095;&#1077;&#1084; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074;&#1099;&#1096;&#1077; &#1086;&#1090;&#1095;&#1077;&#1090; DISKPART &#1080; &#1085;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1073;&#1077;&#1089;&#1089;&#1084;&#1099;&#1089;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;, &#1082;&#1072;&#1082; &#1074; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1077; Status: &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1074;&#1089;&#1077; &#1090;&#1086;&#1084;&#1072; &#1079;&#1076;&#1086;&#1088;&#1086;&#1074;&#1099;, &#1072; &#1080;&#1085;&#1072;&#1095;&#1077; &#1073;&#1099; &#1087;&#1088;&#1080;&#1096;&#1083;&#1086;&#1089;&#1100; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100;&#1089;&#1103; &#1080;&#1093; &#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084;, &#1072; &#1085;&#1077; &#1089;&#1086;&#1088;&#1077;&#1074;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;&#1084;&#1080; &#1074; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1080; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;.</span></p><p class="c4 c5"><span></span></p><p class="c4 c5"><span></span></p><p class="c4 c5"><span></span></p><p class="c4"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 602.00px; height: 229.33px;"><img alt="" src="image01.png" style="width: 602.00px; height: 229.33px; margin-left: 0.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1056;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 2.</span></p><p class="c4 c5"><span></span></p><p class="c4"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 602.00px; height: 224.00px;"><img alt="" src="image00.png" style="width: 602.00px; height: 224.00px; margin-left: 0.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1056;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 3.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1056;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 2 &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1082;&#1088;&#1072;&#1090;&#1082;&#1080;&#1081; &#1086;&#1090;&#1095;&#1077;&#1090; EnumDevicesAndVolumes.wsf &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; Windows 8.1, &#1072; &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1086;&#1093;&#1086;&#1078;&#1080;&#1081; &#1088;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 3 &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1099;&#1081; &#1086;&#1090;&#1095;&#1077;&#1090; &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; Windows 10 RTM TH1. &#1056;&#1072;&#1079;&#1085;&#1080;&#1094;&#1072; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1083;&#1080;&#1096;&#1100; &#1074; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1093; &#1087;&#1086;&#1083;&#1077;&#1081; F1: &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072; &ldquo;714ce4NN&rdquo; &#1080; &#1042;&#1099; &#1079;&#1072;&#1084;&#1077;&#1090;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1083;&#1080;&#1096;&#1100; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1076;&#1074;&#1072; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1102;&#1090; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1080;&#1077; DevGUID.F1 &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; Mbr-&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1076;&#1080;&#1089;&#1082;&#1086;&#1074;, SD-&#1082;&#1072;&#1088;&#1090;&#1099; &#1080; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1086;&#1074; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1080;&#1079; &#1076;&#1074;&#1091;&#1093; Gpt-&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; VHD. &#1041;&#1086;&#1083;&#1077;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1090;&#1072;&#1082;&#1086;&#1081; &#1078;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1080;&#1084;&#1077;&#1102;&#1090; &#1080; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077; VolGUID.F1, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072;&#1084; &#1085;&#1072; Mbr-&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1076;&#1080;&#1089;&#1082;&#1072;&#1093;. &#1053;&#1086; &#1074;&#1086;&#1090; &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; Windows 10, &#1075;&#1076;&#1077;, &#1082;&#1072;&#1082; &#1091;&#1078;&#1077; &#1091;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1083;&#1086;&#1089;&#1100;, &#1073;&#1099;&#1083;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1099;</span></p><p class="c4"><span>&#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; VolumeGUID, &ldquo;714ce4NN&rdquo; &#1087;&#1088;&#1080;&#1087;&#1080;&#1089;&#1072;&#1085; &#1083;&#1080;&#1096;&#1100; &#1076;&#1074;&#1091;&#1084; &#1090;&#1086;&#1084;&#1072;&#1084;, &#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1085;&#1072; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1076;&#1080;&#1089;&#1082;&#1077;, &#1084;&#1077;&#1090;&#1082;&#1072; System Reserved &#1080; &#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1085;&#1072; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1076;&#1080;&#1089;&#1082;&#1077;, &#1084;&#1077;&#1090;&#1082;&#1072; TOSH-MK1646GSX. &#1041;&#1086;&#1083;&#1077;&#1077; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079; &#1074;&#1099;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &ldquo;&#1075;&#1077;&#1085;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1088;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072;&rdquo; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; GUID, JS-&#1089;&#1082;&#1088;&#1080;&#1087;&#1090; EnumDevicesAndVolumes.wsf &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1074; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1086;&#1084; &#1086;&#1090;&#1095;&#1077;&#1090;&#1077;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1086;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084; ShowResemblanse().</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4 c5"><span></span></p><p class="c4 c5"><span></span></p><p class="c4 c5"><span></span></p><p class="c4"><span class="c11">&#1047;&#1072;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1079;&#1072;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1103; &#1082; &#1087;&#1077;&#1088;&#1074;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080;.</span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1054;&#1073;&#1098;&#1103;&#1089;&#1085;&#1102; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &ldquo;Windows Registry&rdquo; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &ldquo;&#1057;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1081; &#1056;&#1077;&#1077;&#1089;&#1090;&#1088;&rdquo; &#1090;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1074; &#1084;&#1086;&#1077;&#1084; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1088;&#1091;&#1089;&#1089;&#1082;&#1086;&#1077; &#1089;&#1083;&#1086;&#1074;&#1086; &ldquo;&#1088;&#1077;&#1077;&#1089;&#1090;&#1088;&rdquo; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1086; &ldquo;&#1072;&#1084;&#1073;&#1072;&#1088;&#1085;&#1086;&#1081; &#1082;&#1085;&#1080;&#1075;&#1077;&rdquo; &#1080; &#1080;&#1084;&#1077;&#1085;&#1091;&#1077;&#1090; &ldquo;&#1087;&#1083;&#1086;&#1089;&#1082;&#1080;&#1081; &#1092;&#1072;&#1081;&#1083;&rdquo;, &#1072; &#1085;&#1080;&#1082;&#1072;&#1082; &#1085;&#1077; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1095;&#1077;&#1089;&#1082;&#1091;&#1102; &#1073;&#1072;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1082;&#1086;&#1077;&#1081; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; Windows Registry. </span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1055;&#1086;&#1095;&#1077;&#1084;&#1091; &ldquo;&#1082;&#1086;&#1076;-&#1087;&#1088;&#1086;&#1090;&#1086;&#1090;&#1080;&#1087;&rdquo;? &#1048;&#1079;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086; &#1074; &#1087;&#1086;&#1076;&#1088;&#1072;&#1078;&#1072;&#1085;&#1080;&#1077; DISKPART.EXE &#1087;&#1083;&#1072;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083;&#1086;&#1089;&#1100; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; FAD-&#1082;&#1086;&#1076;, &ldquo;Fast And Dirty&rdquo;, &#1085;&#1086; &#1078;&#1080;&#1079;&#1085;&#1100; &#1080; Microsoft &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1074;&#1099;&#1085;&#1091;&#1076;&#1080;&#1083;&#1080; &#1091;&#1073;&#1088;&#1072;&#1090;&#1100; &#1089;&#1083;&#1086;&#1074;&#1086; Fast, &#1085;&#1091; &#1072; &#1087;&#1086;&#1090;&#1086;&#1084; &#1091;&#1078;&#1077; &#1103; &#1089;&#1072;&#1084; &#1088;&#1077;&#1096;&#1080;&#1083; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1082;&#1086;&#1076; &#1087;&#1086;&#1095;&#1080;&#1097;&#1077; &#1080; &#1087;&#1088;&#1080;&#1075;&#1086;&#1076;&#1085;&#1099;&#1084; &#1076;&#1083;&#1103; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1085;&#1072; C, C++, C#. &#1053;&#1086; &#1074;&#1089;&#1077; &#1078;&#1077; &#1082;&#1086;&#1076; &#1086;&#1089;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1055;&#1056;&#1054;&#1058;&#1054;&#1058;&#1048;&#1055;&#1054;&#1052; &#1074; &#1090;&#1086;&#1084; &#1089;&#1084;&#1099;&#1089;&#1083;&#1077;, &#1095;&#1090;&#1086; &#1085;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; &#1085;&#1080;&#1082;&#1072;&#1082;&#1086;&#1075;&#1086; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1072; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;, &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084; &#1074; &#1090;&#1088;&#1077;&#1093; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1103;&#1093;.</span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1042;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1087;&#1083;&#1072;&#1085;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1086;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077; &#1096;&#1072;&#1075;&#1072; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072;, &#1087;&#1077;&#1088;&#1074;&#1099;&#1077; &#1090;&#1088;&#1080; &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1090; &#1076;&#1074;&#1091;&#1084; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1072;&#1084;, &#1087;&#1088;&#1086;&#1074;&#1086;&#1079;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1085;&#1099;&#1084; &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1101;&#1090;&#1086;&#1081; &#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080;. &#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1080;&#1079; &#1087;&#1077;&#1088;&#1074;&#1099;&#1093; &#1090;&#1088;&#1077;&#1093; &#1096;&#1072;&#1075;&#1086;&#1074; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086; &#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103;, &nbsp;&#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1080;&#1079; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &ldquo;&#1084;&#1091;&#1089;&#1086;&#1088;&#1086;&#1089;&#1073;&#1086;&#1088;&#1085;&#1080;&#1082;&#1072;&rdquo; &nbsp;&#1080; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1072;&#1077;&#1090;&#1089;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;&#1084; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1085;&#1072;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074;&#1089;&#1077;&#1084;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1084;&#1080; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080; &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1081; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080;.</span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1042;&#1087;&#1088;&#1086;&#1095;&#1077;&#1084; &#1078;&#1077;&#1083;&#1072;&#1102;&#1097;&#1080;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1085;&#1077; &#1076;&#1086;&#1078;&#1080;&#1076;&#1072;&#1103;&#1089;&#1100; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1080; &#1074;&#1099;&#1082;&#1072;&#1095;&#1072;&#1090;&#1100; EnumDevicesAndVolumes.wsf, WhoIsFaster.js &#1087;&#1086; &#1089;&#1089;&#1099;&#1083;&#1082;&#1077;</span></p><p class="c4 c5"><span></span></p><p class="c4"><span class="c10"><a class="c14" href="https://www.google.com/url?q=https%3A%2F%2Fgithub.com%2Fsysprg-46%2FEnumerateDevicesAndVolumesWin%2Ftree%2Fmaster&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNGJyAnH11f4TpoRceM6WJTfhTcIAQ">https://github.com/sysprg-46/EnumerateDevicesAndVolumesWin/tree/master</a></span></p><p class="c4 c5"><span></span></p><p class="c4 c5"><span></span></p><p class="c4 c5"><span></span></p><p class="c4 c5"><span class="c18 c11"></span></p><p class="c4 c5"><span class="c18 c11"></span></p><p class="c4 c5"><span class="c18 c11"></span></p><p class="c4 c5"><span class="c18 c11"></span></p><p class="c4 c5"><span class="c18 c11"></span></p><p class="c4 c5"><span class="c18 c11"></span></p><p class="c4 c5"><span class="c18 c11"></span></p><p class="c4 c5"><span class="c18 c11"></span></p><p class="c4 c5"><span class="c18 c11"></span></p><p class="c4 c5"><span class="c18 c11"></span></p><p class="c4 c5"><span class="c11 c18"></span></p><p class="c4 c5"><span class="c18 c11"></span></p><p class="c4 c5"><span class="c18 c11"></span></p><p class="c4 c5"><span class="c18 c11"></span></p><p class="c4 c5"><span class="c18 c11"></span></p><p class="c4 c5"><span class="c18 c11"></span></p><p class="c4 c5"><span class="c18 c11"></span></p><p class="c4 c5"><span class="c18 c11"></span></p><p class="c4 c5"><span class="c18 c11"></span></p><p class="c4"><span class="c18 c11">&#1063;&#1072;&#1089;&#1090;&#1100; 2, &#1082;&#1088;&#1072;&#1090;&#1082;&#1086;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072;.</span></p><p class="c4"><span class="c18 c11">&nbsp;</span></p><p class="c4"><span class="c18 c11">&#1050;&#1072;&#1082; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;</span><span class="c11 c16">&nbsp;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;.</span></p><p class="c4"><span class="c11 c16">&nbsp;</span></p><p class="c4"><span>&#1042; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077;&#1093; &#1096;&#1072;&#1075;&#1086;&#1074; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1090;&#1088;&#1080; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077; &#1059;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, DevicesCollection, &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1072;&#1084;&#1086;&#1081; &#1087;&#1077;&#1088;&#1074;&#1086;&#1081;, &#1085;&#1072; &#1096;&#1072;&#1075;&#1077; 1 &#1080; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1074;&#1089;&#1077;&#1093; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1096;&#1072;&#1075;&#1072;&#1093; &#1076;&#1083;&#1103; &#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1082; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1084;&#1091; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1091;. &#1053;&#1072; &#1096;&#1072;&#1075;&#1077; 2 &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; StorageVolumesCollection, &#1072; &#1085;&#1072; &#1096;&#1072;&#1075;&#1077; 3, LogicalVolumesCollection. &#1042;&#1089;&#1077; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1099; &#1087;&#1086; &#1077;&#1076;&#1080;&#1085;&#1086;&#1084;&#1091; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1091;: &#1074;&#1089;&#1077; &#1093;&#1088;&#1072;&#1085;&#1080;&#1084;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1087;&#1088;&#1086;&#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1080; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100;&#1089;&#1103; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1082; &#1093;&#1088;&#1072;&#1085;&#1080;&#1084;&#1086;&#1084;&#1091; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1091;, &#1085;&#1072;&#1076;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100;&#1089;&#1103; &#1082; XXXXXCollection[ index ], &#1075;&#1076;&#1077; XXXXX: { Devices, StorageVolumes, LogicalVolumes }, &#1072; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &ndash; &#1083;&#1102;&#1073;&#1086;&#1077; &#1094;&#1077;&#1083;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1074; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085;&#1077; [0, &nbsp;XXXXXCollection.Count]. &#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; Count &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072; &#1074; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1057;&#1090;&#1088;&#1086;&#1082;&#1080; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;, &#1093;&#1088;&#1072;&#1085;&#1080;&#1084;&#1099;&#1077; &#1074; &#1073;&#1080;&#1085;&#1072;&#1088;&#1085;&#1086;&#1084; &#1073;&#1083;&#1086;&#1073;&#1077; Data, &#1085;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; DeviceGUID &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; DVD-ROM, &#1085;&#1086; &#1080; &#1076;&#1083;&#1103; Removables. &#1059;&#1087;&#1086;&#1084;&#1103;&#1085;&#1091;&#1090;&#1099;&#1081; &#1073;&#1080;&#1085;&#1072;&#1088;&#1085;&#1099;&#1081; &#1073;&#1083;&#1086;&#1073; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1089;&#1090;&#1080;&#1082;&#1080; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1090;&#1086;&#1084;&#1072; &#1080; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091;&#1077;&#1090;&#1089;&#1103; Registry &#1087;&#1091;&#1090;&#1077;&#1084;:</span></p><p class="c4 c5"><span></span></p><p class="c4"><span class="c12">HKU\SID\Software\Microsoft\Windows\CurrentVersion\Explorer\MountPoints2\CPC\Volume\GUID</span><span>, &#1075;&#1076;&#1077; GUID &#1101;&#1090;&#1086; VolumeGUID, SID &ndash; Security Identifier &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;. &#1042; &#1089;&#1074;&#1103;&#1079;&#1080; &#1089; &#1101;&#1090;&#1080;&#1084; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1103; DevicesCollection &#1080; LogicalVolumesCollection &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &ldquo;&#1082;&#1083;&#1102;&#1095;&#1080; &#1087;&#1088;&#1103;&#1084;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;&rdquo; &#1082;&#1072;&#1082; &#1074; &#1074;&#1080;&#1076;&#1077; &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1080;&#1093; 8-&#1084;&#1080; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1100;&#1085;&#1099;&#1093; DeviceGUID.F1, &#1090;&#1072;&#1082; &#1080; &#1076;&#1083;&#1080;&#1085;&#1085;&#1099;&#1093;, &#1085;&#1077;&#1087;&#1088;&#1077;&#1076;&#1089;&#1082;&#1072;&#1079;&#1091;&#1077;&#1084;&#1086;&#1081; &#1076;&#1083;&#1080;&#1085;&#1099; &#1076;&#1083;&#1103; DVD-ROM &#1080; Removables. &nbsp;&#1050;&#1083;&#1102;&#1095;&#1080; &#1087;&#1088;&#1103;&#1084;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1082;&#1083;&#1102;&#1095;&#1091;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1076;&#1083;&#1080;&#1085;&#1085;&#1099;&#1081; &#1082;&#1083;&#1102;&#1095;, PnPDeviceID &#1076;&#1083;&#1103; &#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1082; DevicesCollection, &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1075;&#1086; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;. &#1069;&#1090;&#1086; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1085;&#1077;&#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086; &#1087;&#1088;&#1080;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; ParentIndex &#1090;&#1086;&#1084;&#1091; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1091; &#1090;&#1080;&#1087;&#1072; StorageVolume &#1080;&#1083;&#1080; LogicalVolume, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1072;&#1076;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1074; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1081; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span class="c11 c16">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1096;&#1072;&#1075;&#1072; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072;: &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; DevicesCollection.</span></p><p class="c4"><span class="c11 c16">&nbsp;</span></p><p class="c4"><span>&#1048;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;:</span></p><p class="c4"><span>&nbsp;</span></p><p class="c1 c9"><span>1. &nbsp; &#1055;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1089;&#1083;&#1091;&#1078;&#1073;&#1072;&#1084;&#1080; cdrom &#1080; partmgr. &#1058;&#1088;&#1091;&#1076;&#1103;&#1075;&#1072; partmgr &#1084;&#1072;&#1083;&#1086; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1086;&#1074; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074; &#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090; &#1089;&#1074;&#1086;&#1102; &#1075;&#1083;&#1072;&#1074;&#1085;&#1091;&#1102; &#1079;&#1072;&#1076;&#1072;&#1095;&#1091; &ndash; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1090;&#1086;&#1084;&#1086;&#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1077;&#1097;&#1077; &#1080; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1089;&#1077; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074; &#1082;&#1088;&#1086;&#1084;&#1077; &#1090;&#1077;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1073;&#1089;&#1083;&#1091;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1091;&#1078;&#1073;&#1072; cdrom. &#1055;&#1086;&#1085;&#1103;&#1090;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1088;&#1077;&#1095;&#1100; &#1080;&#1076;&#1077;&#1090; &#1086; &#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1085;&#1080;&#1080; &#1074;&#1089;&#1077;&#1093; REG_SZ &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1087;&#1086; &#1087;&#1091;&#1090;&#1103;&#1084;:</span></p><p class="c1 c9 c5"><span></span></p><p class="c1"><span class="c12">HKLM\SYSTEM\CurrentControlSet\Services\cdrom</span><span>&nbsp;&#1080;</span></p><p class="c1"><span class="c12">HKLM\SYSTEM\CurrentControlSet\Services\partmrg</span><span>.</span></p><p class="c1 c5"><span></span></p><p class="c1 c9"><span>2. &nbsp; &#1048;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1086;&#1073; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1093; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1091; PnPDeviceID. &#1053;&#1072;&#1089;&#1090;&#1072;&#1083; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; PnPDeviceID, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1077; &#1074; &#1087;&#1077;&#1088;&#1074;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;, &#1077;&#1097;&#1077; &#1080; &#1091;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1085;&#1080;&#1077;&#1084; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; PnPDeviceID &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1088;&#1077;&#1092;&#1080;&#1082;&#1089;&#1072; &#1082; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;, &#1077;&#1097;&#1077; &#1080; &#1087;&#1088;&#1077;&#1092;&#1080;&#1082;&#1089;, &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;, &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1085;&#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084;&#1091; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1086;. &#1055;&#1088;&#1080;&#1095;&#1077;&#1084; &#1103; &#1085;&#1077; &#1084;&#1086;&#1075;&#1091; &#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1091;&#1074;&#1077;&#1088;&#1077;&#1085;&#1085;&#1086;, &#1087;&#1088;&#1080;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1083;&#1080; &#1101;&#1090;&#1086;&#1090; &#1087;&#1088;&#1077;&#1092;&#1080;&#1082;&#1089; Windows &#1082; &#1090;&#1086;&#1084;&#1091; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1102; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100; &#1080;&#1083;&#1080; &#1089;&#1072;&#1084; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;. &#1042; &#1083;&#1102;&#1073;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, PnPDeviceID &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1090;&#1086;&#1095;&#1085;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086; &#1090;&#1086;&#1084;, &#1087;&#1086; &#1082;&#1072;&#1082;&#1086;&#1084;&#1091; &#1087;&#1091;&#1090;&#1080; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1089;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1080;&#1079;</span></p><p class="c1"><span class="c12">HKLM\SYSTEM\CurrentControlSet\Enum</span><span>. &#1055;&#1088;&#1086;&#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1077;&#1084; &#1101;&#1090;&#1086;&#1090; &#1074;&#1072;&#1078;&#1085;&#1077;&#1081;&#1096;&#1080;&#1081; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1086;&#1073; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1093;, &#1089;&#1085;&#1080;&#1084;&#1082;&#1086;&#1084; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072;.</span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&nbsp;</span><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 602.00px; height: 376.00px;"><img alt="" src="image03.png" style="width: 602.00px; height: 376.00px; margin-left: 0.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1056;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 4.</span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1055;&#1086;&#1084;&#1080;&#1084;&#1086;</span><span class="c12">&nbsp;HKLM\SYSTEM\CurrentControlSet\Enum\PnPDeviceID</span><span>, &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1077;&#1097;&#1077; &#1076;&#1074;&#1072; &#1087;&#1091;&#1090;&#1080;:</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span class="c12">HKLM\SYSTEM\CurrentControlSet\Enum\PnPDeviceID\Device Parameters\Partmgr</span><span>, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1081; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074;&#1072;&#1078;&#1085;&#1077;&#1081;&#1096;&#1077;&#1075;&#1086; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; DiskId, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1089;&#1102;&#1076;&#1091; &#1088;&#1072;&#1085;&#1077;&#1077; &#1091;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1083;&#1086;&#1089;&#1100; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; DevGUID.</span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1045;&#1097;&#1077; &#1088;&#1072;&#1079; &#1085;&#1072;&#1087;&#1086;&#1084;&#1085;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1076;&#1083;&#1103; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;, &#1086;&#1073;&#1089;&#1083;&#1091;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1089;&#1083;&#1091;&#1078;&#1073;&#1086;&#1081; cdrom, DiskId &#1085;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080; &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1087;&#1088;&#1080;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1091; DevID &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; PnPDeviceID &#1089; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072;&#1084;&#1080; &ldquo;\&rdquo; &#1079;&#1072;&#1084;&#1077;&#1085;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1085;&#1072; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; &ldquo;#&rdquo;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span class="c12">HKLM\SYSTEM\CurrentControlSet\Enum\PnPDeviceID\Device Parameters\Storport</span><span>&nbsp;&#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; InitialTimestamp, &#1076;&#1072;&#1090;&#1091; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1072; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1077;&#1084; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; REG_QWORD.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1072;&#1084;&#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1076;&#1083;&#1103; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1093; &#1076;&#1080;&#1089;&#1082;&#1086;&#1074;, &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1087;&#1091;&#1090;&#1080;:</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span class="c12">HKLM\HARDWARE\DESCRIPTION\System\MultifunctionAdapter\0\DiskController\0\DiskPeripheral</span></p><p class="c4"><span class="c12">HKLM\HARDWARE\DEVICEMAP\Scsi\Scsi Port 1\Scsi Bus 0\Target Id 0\Logical Unit Id M.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1055;&#1086; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084;&#1091; &#1080;&#1079; &#1087;&#1091;&#1090;&#1077;&#1081; &#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; REG_SZ &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; Identifier, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1077;&#1077; &#1076;&#1083;&#1103; Mbr-&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1076;&#1080;&#1089;&#1082;&#1086;&#1074; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1100; &#1076;&#1080;&#1089;&#1082;&#1072;, &#1072; &#1076;&#1083;&#1103; Gpt-&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1085;&#1091;&#1083;&#1080;, &#1095;&#1090;&#1086; &#1080; &#1089;&#1074;&#1080;&#1076;&#1077;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1076;&#1080;&#1089;&#1082; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; Gpt-&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1099;. &#1069;&#1090;&#1086; &#1086;&#1095;&#1077;&#1085;&#1100; &#1074;&#1072;&#1078;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1076;&#1083;&#1103; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072;, &#1085;&#1086;, &#1082; &#1089;&#1086;&#1078;&#1072;&#1083;&#1077;&#1085;&#1080;&#1102;, &#1101;&#1090;&#1072; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1083;&#1080;&#1096;&#1100; &#1076;&#1083;&#1103; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1093; &#1076;&#1080;&#1089;&#1082;&#1086;&#1074;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1055;&#1086;&#1089;&#1083;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1085;&#1072;&#1076;&#1077;&#1083;&#1077;&#1085; &#1074;&#1089;&#1077;&#1084;&#1080; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080;, &#1089;&#1095;&#1080;&#1090;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1080;&#1079; Registry &#1080; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080;, &#1085;&#1091;&#1078;&#1085;&#1099;&#1084;&#1080; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1091;, &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1085;&#1072;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1072;&#1078;&#1085;&#1077;&#1081;&#1096;&#1080;&#1084; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;&#1084; OrderIndex, &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1088;&#1072;&#1074;&#1085;&#1099;&#1084; DevicesCollection.Count. &#1055;&#1086;&#1089;&#1083;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1102; &#1087;&#1086; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1091; &#1088;&#1072;&#1074;&#1085;&#1086;&#1084;&#1091; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1102; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080; Count &#1080; Count &#1080;&#1085;&#1082;&#1088;&#1077;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103;. &#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1082;&#1083;&#1102;&#1095;&#1080; &#1087;&#1088;&#1103;&#1084;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; Removables &#1080; DVD-ROM, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1080;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103; &#1075;&#1088;&#1091;&#1087;&#1087;&#1086;&#1074;&#1099;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;, &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1080; &#1090;&#1088;&#1077;&#1090;&#1100;&#1077;&#1084; &#1096;&#1072;&#1075;&#1072;&#1093;. &#1055;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1084; &#1079;&#1076;&#1077;&#1089;&#1100; &#1101;&#1090;&#1080; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;:</span></p><p class="c4"><span>LVGroupStyle &ndash; &#1089;&#1090;&#1080;&#1083;&#1100; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; Mbr, Gpt. &nbsp;</span></p><p class="c4"><span>NumberOfLV &nbsp;- &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1090;&#1086;&#1084;&#1086;&#1074;, &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1085;&#1099;&#1093; &#1085;&#1072; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072;&#1093; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;.</span></p><p class="c4"><span>LVGroup &nbsp; &nbsp; &nbsp; &nbsp; - &nbsp;&#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1081; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1090;&#1086;&#1084;&#1086;&#1074;</span></p><p class="c4"><span>NumberOfSV - &nbsp;&#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1086;&#1074;, Storage#Volume, &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1085;&#1099;&#1093; &#1085;&#1072; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1077; &nbsp;</span></p><p class="c4"><span>SVGroup &nbsp; &nbsp; &nbsp; &nbsp;- &nbsp; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1081; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1086;&#1074;</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span class="c11 c16">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1074;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1096;&#1072;&#1075;&#1072; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072;: &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; StorageVolumesCollection.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1048;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;:</span></p><p class="c4"><span>&nbsp;</span></p><p class="c1 c9"><span>1. &nbsp; &#1055;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1077; </span><span class="c12">HKLM\SYSTEM\CurrentControlSet\services\volsnap\Enum</span></p><p class="c1"><span>&#1054;&#1041;&#1071;&#1047;&#1040;&#1053; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1091;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1077;&#1085;&#1085;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; Storage#Volume, &#1090;&#1086;&#1084;&#1086;&#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1089;&#1083;&#1091;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1082;&#1072;&#1079;&#1091;&#1089;&#1099; &#1076;&#1072;&#1078;&#1077; &#1074; &#1090;&#1072;&#1082;&#1086;&#1081; &#1074;&#1099;&#1083;&#1080;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;, &#1082;&#1072;&#1082; Windows 8.1. &#1057;&#1072;&#1084;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1087;&#1088;&#1086;&#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1099;&#1081; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090; Registry, &#1093;&#1088;&#1072;&#1085;&#1080;&#1084;&#1099;&#1081; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1092;&#1072;&#1081;&#1083;&#1072;</span></p><p class="c1"><span>BecameCrazy-volsnap.reg. &#1042;&#1086;&#1090; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090; &#1080;&#1079; &#1101;&#1090;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;.</span></p><p class="c1"><span>&nbsp;</span></p><p class="c1"><span class="c3">[HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Services\volsnap\Enum]</span></p><p class="c1"><span class="c3">&quot;0&quot;=&quot;STORAGE\\Volume\\_??_SD#DISK&amp;Generic&amp;SA08G&amp;0.4#6&amp;447d92&amp;0&amp;9c053461#{53f56307-b6bf-11d0-94f2-00a0c91efb8b}&quot;</span></p><p class="c1"><span class="c3">&quot;Count&quot;=dword:00000011</span></p><p class="c1"><span class="c3">&quot;NextInstance&quot;=dword:00000011</span></p><p class="c1"><span class="c3">&quot;1&quot;=&quot;STORAGE\\Volume\\{714ce426-d2a2-11e4-824f-806e6f6e6963}#0000000000007E00&quot;</span></p><p class="c1"><span class="c3">&quot;2&quot;=&quot;STORAGE\\Volume\\{714ce426-d2a2-11e4-824f-806e6f6e6963}#0000000016260000&quot;</span></p><p class="c1"><span class="c3">&nbsp;</span></p><p class="c1"><span>&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &ldquo;0&rdquo;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1091;&#1102; SD-&#1082;&#1072;&#1088;&#1090;&#1077;. &#1050;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1101;&#1090;&#1086;&#1081; &#1082;&#1072;&#1088;&#1090;&#1077; &#1073;&#1099;&#1083; &#1087;&#1088;&#1080;&#1089;&#1074;&#1086;&#1077;&#1085; &#1090;&#1072;&#1082;&#1086;&#1081; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1080;&#1090;&#1100; &#1090;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086; &#1089;&#1083;&#1091;&#1095;&#1080;&#1083;&#1089;&#1103; &#1089;&#1073;&#1086;&#1081; &#1087;&#1088;&#1080; &#1095;&#1090;&#1077;&#1085;&#1080;&#1080; &#1074;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1077;&#1075;&#1086; &#1076;&#1080;&#1089;&#1082;&#1072;, &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1083;&#1072; &#1089;&#1073;&#1086;&#1081;, &#1074;&#1099;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1083;&#1072; &#1073;&#1080;&#1090; Dirty &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072; &#1080; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1086;&#1090;&#1095;&#1077;&#1090; partmgr &#1086; &#1090;&#1086;&#1084;&#1077; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1085;&#1072; SD-&#1082;&#1072;&#1088;&#1090;&#1077; &#1086;&#1087;&#1077;&#1088;&#1077;&#1076;&#1080;&#1083; &#1087;&#1086;&#1089;&#1090;&#1091;&#1087;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090;&#1095;&#1077;&#1090;&#1086;&#1074; &#1086; &#1090;&#1086;&#1084;&#1072;&#1093; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1085;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1093; &#1076;&#1080;&#1089;&#1082;&#1072;&#1093;. &#1050; &#1095;&#1077;&#1089;&#1090;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1091;&#1090;&#1086;&#1095;&#1085;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1089;&#1083;&#1091;&#1095;&#1080;&#1083;&#1086;&#1089;&#1100; &#1101;&#1090;&#1086; &#1083;&#1080;&#1096;&#1100; &#1086;&#1076;&#1085;&#1072;&#1078;&#1076;&#1099;, &#1084;&#1086;&#1075;&#1091; &#1085;&#1072;&#1079;&#1074;&#1072;&#1090;&#1100; &#1076;&#1072;&#1078;&#1077; &#1090;&#1086;&#1095;&#1085;&#1091;&#1102; &#1076;&#1072;&#1090;&#1091; &ndash; 01.07.2015.</span></p><p class="c1 c5"><span></span></p><p class="c1"><span>&#1053;&#1086; &#1087;&#1088;&#1086;&#1097;&#1077; &#1085;&#1077; &#1089;&#1077;&#1090;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072; &#1085;&#1077;&#1086;&#1078;&#1080;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1075;&#1083;&#1102;&#1082;&#1080;, &#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1099;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086; &#1086;&#1090; &#1089;&#1102;&#1088;&#1087;&#1088;&#1080;&#1079;&#1086;&#1074;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1082;&#1072;&#1079;&#1091;&#1089; &#1074;&#1099;&#1085;&#1091;&#1076;&#1080;&#1083; &#1085;&#1077;&#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;: &#1077;&#1089;&#1083;&#1080; &#1088;&#1072;&#1085;&#1100;&#1096;&#1077; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1074;&#1089;&#1077;&#1094;&#1077;&#1083;&#1086; &#1076;&#1086;&#1074;&#1077;&#1088;&#1103;&#1083; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1091; &#1089;&#1090;&#1088;&#1086;&#1082;, &#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1087;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1087;&#1091;&#1090;&#1080;, &#1090;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; &#1089;&#1083;&#1091;&#1095;&#1080;&#1074;&#1096;&#1077;&#1075;&#1086;&#1089;&#1103; &#1074; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1073;&#1099;&#1083; &#1079;&#1072;&#1083;&#1086;&#1078;&#1077;&#1085; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087; &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1091;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1089; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1084; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1084; &#1080; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;&#1084;. </span></p><p class="c1 c5"><span></span></p><p class="c1"><span>&#1069;&#1090;&#1086;&#1090; &#1078;&#1077; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1080; &#1085;&#1072; &#1096;&#1072;&#1075;&#1077; 3 &#1087;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1090;&#1086;&#1084;&#1086;&#1074;, &#1080; &#1086;&#1085; &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1091;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1077;&#1085;&#1080;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1084;, &#1077;&#1089;&#1083;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1077; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090; &ldquo;&#1076;&#1091;&#1088;&#1080;&#1090;&#1100;&rdquo; &#1077;&#1097;&#1077; &#1080; &#1089;&#1083;&#1091;&#1078;&#1073;&#1072; partmgr &#1080; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1072;&#1085;&#1091;&#1090; &#1087;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;&#1090;&#1100; &#1074; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077; &#1074;&#1086;&#1079;&#1088;&#1072;&#1089;&#1090;&#1072;&#1085;&#1080;&#1103;. &#1048;&#1084;&#1077;&#1085;&#1085;&#1086; &#1101;&#1090;&#1086; &#1080; &#1089;&#1083;&#1091;&#1095;&#1080;&#1083;&#1086;&#1089;&#1100; &#1087;&#1086;&#1076; Windows 10 RTM TH1, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081;, &#1082;&#1072;&#1082; &#1091;&#1078;&#1077; &#1073;&#1099;&#1083;&#1086; &#1089;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086;, &#1073;&#1099;&#1083; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1091;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1077;&#1085;&#1080;&#1103; Volume GUID. &#1045;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1101;&#1090;&#1086; &#1074;&#1099;&#1079;&#1074;&#1072;&#1083;&#1086; &#1091; &#1084;&#1077;&#1085;&#1103; &#1073;&#1091;&#1088;&#1085;&#1099;&#1077; &#1101;&#1084;&#1086;&#1094;&#1080;&#1080; &#1080; &#1074;&#1089;&#1103;&#1082;&#1080;&#1077; &#1085;&#1077;&#1076;&#1086;&#1073;&#1088;&#1086;&#1078;&#1077;&#1083;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1083;&#1086;&#1074;&#1072; &#1074; &#1072;&#1076;&#1088;&#1077;&#1089; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1086;&#1074; &#1086;&#1090; MS: &#1085;&#1077; &#1090;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1081; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1072;&#1083; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100;, &#1085;&#1086; &#1091;&#1078; &#1086;&#1095;&#1077;&#1085;&#1100; &#1088;&#1077;&#1079;&#1072;&#1083; &#1075;&#1083;&#1072;&#1079; &#1085;&#1077;&#1091;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1077;&#1085;&#1085;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1081; &#1076;&#1083;&#1103; LVGroup. &#1048; &#1083;&#1080;&#1096;&#1100; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1091; &#1095;&#1072;&#1089;&#1086;&#1074; &#1103; &#1086;&#1089;&#1086;&#1079;&#1085;&#1072;&#1083;, &#1063;&#1045;&#1052; &#1073;&#1099;&#1083;&#1086; &#1074;&#1099;&#1079;&#1074;&#1072;&#1085;&#1086; &#1101;&#1090;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1086; &#1087;&#1088;&#1080;&#1085;&#1077;&#1089;&#1083;&#1086; &#1080; &#1089; &#1090;&#1086;&#1075;&#1086; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072; &#1083;&#1080;&#1096;&#1100; &#1087;&#1086;&#1102; &#1076;&#1080;&#1092;&#1080;&#1088;&#1072;&#1084;&#1073;&#1099; &#1072;&#1074;&#1090;&#1086;&#1088;&#1091; &#1080;&#1076;&#1077;&#1080; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072; &#1091;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1077;&#1085;&#1080;&#1103;.</span></p><p class="c1 c9"><span>2. &nbsp; &nbsp; &nbsp; </span><span class="c12">HKLM\SYSTEM\CurrentControlSet\Enum\STORAGE\Volume\_??_SD#DISK&amp;Generic&amp;SA08G&amp;0.4#6&amp;447d92&amp;0&amp;9c053461&amp;0#{53f56307-b6bf-11d0-94f2-00a0c91efb8b}</span></p><p class="c1"><span>&nbsp;</span></p><p class="c1"><span>&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;:</span></p><p class="c1"><span>&nbsp;</span></p><p class="c1"><span class="c3">&nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&quot;Capabilities&quot;=dword:000000b0</span></p><p class="c1"><span class="c3">&nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&quot;ContainerID&quot;=&quot;{33b560f6-21b5-11e5-b2ff-806e6f6e6963}&quot;</span></p><p class="c1"><span class="c3">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&quot;HardwareID&quot;=hex(7):530054004f0052004100470045005c0056006f &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;006c0075006d00650000000000</span></p><p class="c1"><span class="c3">&nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&quot;ClassGUID&quot;=&quot;{71a27cdd-812a-11d0-bec7-08002be2092f}&quot;</span></p><p class="c1"><span class="c3">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&quot;Service&quot;=&quot;volsnap&quot;</span></p><p class="c1"><span class="c3">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&quot;DeviceDesc&quot;=&quot;@volume.inf,%storage\\volume.devicedesc%;Generic volume&quot;</span></p><p class="c1"><span class="c3">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&quot;Driver&quot;=&quot;{71a27cdd-812a-11d0-bec7-08002be2092f}\\0000&quot;</span></p><p class="c1"><span class="c3">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&quot;Mfg&quot;=&quot;@volume.inf,%msft%;Microsoft&quot;</span></p><p class="c1"><span class="c3">&nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&quot;ConfigFlags&quot;=dword:00000000</span></p><p class="c1"><span class="c3">&nbsp;</span></p><p class="c4"><span>&#1041;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080;&#1079; &#1101;&#1090;&#1080;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1088;&#1072;&#1085;&#1077;&#1077; &ldquo;&#1074;&#1087;&#1080;&#1089;&#1072;&#1085;&#1086; &#1088;&#1091;&#1095;&#1082;&#1072;&#1084;&#1080;&rdquo;. &#1048;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1080;&#1083; &#1083;&#1080;&#1096;&#1100; ContainerID, &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;, &#1085;&#1086; &#1083;&#1077;&#1085;&#1100; &#1073;&#1099;&#1083;&#1086; &#1090;&#1077;&#1088;&#1103;&#1090;&#1100; &#1074;&#1088;&#1077;&#1084;&#1103; &#1085;&#1072; &#1087;&#1086;&#1080;&#1089;&#1082; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; GUID, &#1089;&#1082;&#1086;&#1088;&#1077;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1077;&#1075;&#1086; GUID &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1072;. &#1058;&#1072;&#1082; &#1095;&#1090;&#1086; &#1085;&#1077; &#1091;&#1074;&#1077;&#1088;&#1077;&#1085;, &#1095;&#1090;&#1086; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1084;&#1099;&#1089;&#1083; &#1090;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1076;&#1088;&#1072;&#1075;&#1086;&#1094;&#1077;&#1085;&#1085;&#1099;&#1077; &#1084;&#1080;&#1083;&#1083;&#1080;&#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1099; &#1085;&#1072; &#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077; &#1101;&#1090;&#1080;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;. &#1043;&#1086;&#1088;&#1072;&#1079;&#1076;&#1086; &#1074;&#1072;&#1078;&#1085;&#1077;&#1077; &#1085;&#1077;&#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086; &#1089;&#1074;&#1103;&#1079;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1081; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1090;&#1086;&#1084;&#1072; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1089; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1084; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;&#1084;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1077;&#1097;&#1077; &#1076;&#1086; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1080;&#1079; </span><span class="c12">HKLM\SYSTEM\CurrentControlSet\Enum\STORAGE\Volume\,</span><span>&nbsp;&#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1088;&#1072;&#1079;&#1073;&#1086;&#1088; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;, &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1081; &#1090;&#1086;&#1084; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1089; &#1094;&#1077;&#1083;&#1100;&#1102; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;:</span></p><p class="c1"><span>&nbsp;</span></p><p class="c1"><span>Type &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;= { &ldquo;Partition&rdquo;, &ldquo;Removable&rdquo; },</span></p><p class="c1"><span>Subtype = { &ldquo;SD&rdquo;, &ldquo;Flash&rdquo;, &ldquo;Virtual&rdquo; },</span></p><p class="c1"><span>Offset</span></p><p class="c1"><span>DevID</span></p><p class="c1"><span>&nbsp;</span></p><p class="c4"><span>&#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1077; &#1080;&#1079; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1088;&#1072;&#1074;&#1085;&#1099;&#1084; &#1087;&#1086;&#1083;&#1102; F1 GUID, &#1087;&#1088;&#1077;&#1076;&#1096;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1102; &#1076;&#1083;&#1103; Type=&rdquo;Partition&rdquo;. &#1042; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1086;&#1090;&#1089;&#1077;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1077;&#1092;&#1080;&#1082;&#1089; &ldquo;STORAGE\Volume\&rdquo; &#1080; &#1089;&#1091;&#1092;&#1092;&#1080;&#1082;&#1089; &ldquo;#{53f56307-b6bf-11d0-94f2-00a0c91efb8b}&rdquo; &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1072;&#1103; &#1074;&#1099;&#1096;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072; &#1080;&#1079; &#1092;&#1072;&#1081;&#1083;&#1072; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &ldquo;crazy&rdquo; &#1076;&#1083;&#1103; SD-&#1082;&#1072;&#1088;&#1090;&#1099; &#1087;&#1088;&#1077;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;:</span></p><p class="c1"><span>&nbsp;</span></p><p class="c1"><span>_??_SD#DISK&amp;Generic&amp;SA08G&amp;0.4#6&amp;447d92&amp;0&amp;9c053461&amp;0</span></p><p class="c1"><span>&nbsp;</span></p><p class="c4"><span>&#1069;&#1090;&#1072; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072; &#1087;&#1088;&#1080;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; DevID. &#1053;&#1091; &#1072; &#1076;&#1072;&#1083;&#1077;&#1077; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1072;&#1078;&#1085;&#1077;&#1081;&#1096;&#1077;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1076;&#1083;&#1103; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1080;&#1079; &ldquo;&#1076;&#1077;&#1090;&#1077;&#1081;&rdquo;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1075;&#1086; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;:</span></p><p class="c1"><span>&nbsp;</span></p><p class="c1"><span>obj.ParentIndex = DevicesCollection[ obj.DevID ]</span></p><p class="c1"><span>&nbsp;</span></p><p class="c4"><span>&#1059;&#1079;&#1085;&#1072;&#1074; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1075;&#1086; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1076;&#1083;&#1103; Removables &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; DevGUID &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103;, &#1090;&#1086;&#1095;&#1085;&#1077;&#1077; DevGUID &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1091; &#1085;&#1077; &#1085;&#1091;&#1078;&#1077;&#1085;, &#1072; &#1085;&#1091;&#1078;&#1085;&#1086; &#1083;&#1080;&#1096;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1103; F1 &#1086;&#1090; DevGUID. &#1069;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; DCUniqueID. &#1047;&#1085;&#1072;&#1103; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; DCUniqueID, &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1072;:</span></p><p class="c1"><span>&nbsp;</span></p><p class="c1"><span>obj.SVUniqueID = DevicesCollection[ obj.ParentIndex ].DCUniqueID + obj.Offset</span></p><p class="c1"><span>&nbsp;</span></p><p class="c4"><span>&#1044;&#1083;&#1103; &#1090;&#1086;&#1084;&#1086;&#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1090;&#1080;&#1087;&#1072; &ldquo;Partition&rdquo; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;, &#1072; &#1076;&#1083;&#1103; &#1090;&#1086;&#1084;&#1086;&#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1085;&#1099;&#1093; &#1085;&#1072; Removables, &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1088;&#1072;&#1074;&#1085;&#1099;&#1084; &ldquo;00000000&rdquo;.</span></p><p class="c4"><span>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;, &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1093; SVGroup &#1080; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1090;&#1086;&#1084;&#1086;&#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1085;&#1099;&#1093; &#1085;&#1072; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1084; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1077;. &#1058;&#1086; &#1077;&#1089;&#1090;&#1100; &#1080;&#1085;&#1082;&#1088;&#1077;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1095;&#1077;&#1090;&#1095;&#1080;&#1082; DevicesCollection[ obj.parentIndex ].NumberOfSV &#1080; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1074; &#1089;&#1095;&#1077;&#1090;&#1095;&#1080;&#1082; DevicesCollection[ obj.parentIndex ].SVGroup.</span></p><p class="c1"><span>&nbsp;</span></p><p class="c4"><span>&#1057;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1085;&#1086; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1099;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1080; &#1085;&#1072; &#1096;&#1072;&#1075;&#1077; &#1090;&#1088;&#1080;, &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1082; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1090;&#1086;&#1084;&#1072;&#1084;.</span></p><p class="c1"><span>&nbsp;</span></p><p class="c4"><span>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1085;&#1072;&#1087;&#1086;&#1084;&#1085;&#1102;, &#1095;&#1090;&#1086; &#1084;&#1099; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1084;&#1089;&#1103; &#1074; &#1094;&#1080;&#1082;&#1083;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1089;&#1090;&#1088;&#1086;&#1082;, &#1089;&#1095;&#1080;&#1090;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080;&#1079; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103;. &#1052;&#1099; &#1091;&#1078;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1083;&#1080; &#1074;&#1089;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; StorageVolumesCollection, &#1085;&#1086; &#1087;&#1072;&#1084;&#1103;&#1090;&#1091;&#1103; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1076;&#1086;&#1074;&#1077;&#1088;&#1103;&#1090;&#1100; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1085;&#1077; &#1074; &#1094;&#1077;&#1083;&#1077;&#1074;&#1086;&#1081; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080;, &#1072; &#1074; &#1087;&#1088;&#1086;&#1089;&#1090;&#1077;&#1085;&#1100;&#1082;&#1086;&#1081;, &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081;. &#1053;&#1086; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1075;&#1086;&#1074;&#1086;&#1088;&#1103; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1095;&#1083;&#1077;&#1085;&#1086;&#1084; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1080; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1087;&#1086; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1084;&#1091; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1091; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077; &#1089;&#1072;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1072; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1080;&#1084;&#1077;&#1077;&#1090; &#1090;&#1086;&#1075;&#1086; &#1078;&#1077; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103;.</span></p><p class="c1"><span>&nbsp;</span></p><p class="c4"><span>&#1055;&#1086; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1102; &#1094;&#1080;&#1082;&#1083;&#1072; &#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1084;&#1099; &#1080;&#1084;&#1077;&#1077;&#1084; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1091;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1077;&#1085;&#1085;&#1091;&#1102; &#1094;&#1077;&#1083;&#1077;&#1074;&#1091;&#1102; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1102; StorageVolemesCollection. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1084;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1084; &#1094;&#1080;&#1082;&#1083; &#1087;&#1086; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1081; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080;, DevicesCollection &#1080; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082;&#1086;&#1088;&#1086;&#1090;&#1077;&#1085;&#1100;&#1082;&#1080;&#1093; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1093; &#1094;&#1080;&#1082;&#1083;&#1086;&#1074; &#1087;&#1086; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072;&#1084;, &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1084; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080; &#1090;&#1086;&#1075;&#1086; &#1078;&#1077; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1094;&#1080;&#1082;&#1083;&#1072; &#1084;&#1099; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1084; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1080;&#1079; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080; &#1074; StorageVolumesCollection, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1072; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; StorageVolumesCollection.Count &#1080; &#1080;&#1085;&#1082;&#1088;&#1077;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1091;&#1103; &#1101;&#1090;&#1086; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;. StorageVolumesCollection &#1089;&#1072;&#1084;&#1072;&#1103; &#1087;&#1088;&#1086;&#1089;&#1090;&#1072;&#1103; &#1087;&#1086; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1072;&#1084; &#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1085;&#1077; &#1085;&#1091;&#1078;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1083;&#1102;&#1095;&#1077;&#1081; &#1087;&#1088;&#1103;&#1084;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;.</span></p><p class="c1"><span>&nbsp;</span></p><p class="c4"><span class="c11 c16">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1090;&#1088;&#1077;&#1090;&#1100;&#1077;&#1075;&#1086; &#1096;&#1072;&#1075;&#1072; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072;: &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; LogicalVolumesCollection.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1048;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;:</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1055;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1077;</span></p><p class="c4"><span class="c12">HKU\SID\Software\Microsoft\Windows\CurrentVersion\Explorer\MountPoints2\CPC\Volume\GUID</span></p><p class="c4 c24"><span>&nbsp;</span></p><p class="c4"><span>&#1075;&#1076;&#1077; GUID &#1101;&#1090;&#1086; VolumeGUID, SID &ndash; Security Identifier &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;, &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; VolumeGUID, &#1072; &#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090; &#1073;&#1080;&#1085;&#1072;&#1088;&#1085;&#1086;&#1075;&#1086; &#1073;&#1083;&#1086;&#1073;&#1072; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; Data, &#1072;&#1076;&#1088;&#1077;&#1089;&#1091;&#1077;&#1084;&#1099;&#1081; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1082;&#1083;&#1102;&#1095;&#1086;&#1084;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;. &#1041;&#1083;&#1086;&#1073; Data &#1080;&#1084;&#1077;&#1077;&#1090; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1089;&#1083;&#1086;&#1078;&#1085;&#1091;&#1102; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1091;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1091;&#1102; &#1082;&#1072;&#1082; UTF-16 &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;, &#1090;&#1072;&#1082; &#1080; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1080; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1093; &#1087;&#1086;&#1083;&#1077;&#1081; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1101;&#1090;&#1086;&#1075;&#1086; &#1073;&#1083;&#1086;&#1073;&#1072; &#1079;&#1072;&#1074;&#1080;&#1089;&#1103;&#1090; &#1086;&#1090; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; Windows, &#1084;&#1083;&#1072;&#1076;&#1096;&#1077; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080; 9600 &#1080;&#1083;&#1080; &#1089;&#1090;&#1072;&#1088;&#1096;&#1077;. &#1042; &#1082;&#1086;&#1076;&#1077;-&#1087;&#1088;&#1086;&#1090;&#1086;&#1090;&#1080;&#1087;&#1077; &#1088;&#1072;&#1079;&#1073;&#1086;&#1088;&#1082;&#1091; &#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090;&#1072; &#1101;&#1090;&#1086;&#1075;&#1086; &#1073;&#1083;&#1086;&#1073;&#1072; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; GetBlobs. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1081; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1086;&#1090; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; Windows, &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1091;&#1078;&#1077; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1077; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1093; &#1087;&#1086;&#1083;&#1077;&#1081;. &#1050; &#1091;&#1078;&#1077; &#1089;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1074;&#1099;&#1096;&#1077; &#1087;&#1088;&#1080; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1080; &#1096;&#1072;&#1075;&#1072; &#1076;&#1074;&#1072;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1102; &#1083;&#1080;&#1096;&#1100; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1090;&#1080;&#1087;&#1072; DVD-ROM &#1085;&#1077; &#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1086;&#1085;&#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1090;&#1086;&#1084;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1053;&#1072; &#1096;&#1072;&#1075;&#1077; &#1090;&#1088;&#1080; &#1074;&#1072;&#1078;&#1085;&#1077;&#1081;&#1096;&#1077;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1082;&#1083;&#1102;&#1095;&#1077;&#1081; &#1087;&#1088;&#1103;&#1084;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1074;&#1080;&#1076;&#1072;:</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1076;&#1083;&#1103; Mbr-&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093;: &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1100; &#1076;&#1080;&#1089;&#1082;&#1072; + &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;</span></p><p class="c4"><span>&#1076;&#1083;&#1103; Mbr-&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093;: VolGUID.F1 + &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;</span></p><p class="c4"><span>&#1076;&#1083;&#1103; Gpt-&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093;: VolumeGUID.F1</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1074; &#1090;&#1086;&#1090; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1094;&#1080;&#1082;&#1083; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1076;&#1083;&#1103; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1102; LogicalVolumesCollection, &#1077;&#1097;&#1077; &#1085;&#1077; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1080; &#1076;&#1083;&#1103; USB-&#1076;&#1080;&#1089;&#1082;&#1086;&#1074; &#1080;, &#1082;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1085;&#1077;&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099; &#1057;&#1058;&#1048;&#1051;&#1048; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; Mbr/Gpt &#1082;&#1072;&#1082; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1086;&#1074; &#1085;&#1072; VHD, &#1090;&#1072;&#1082; &#1080; &#1085;&#1072; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093; &#1076;&#1080;&#1089;&#1082;&#1072;&#1093;. </span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1089;&#1090;&#1086;&#1080;&#1090; &#1091;&#1087;&#1086;&#1084;&#1103;&#1085;&#1091;&#1090;&#1100; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1074;&#1080;&#1076; VolumeGUID, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1103;&#1074;&#1080;&#1083;&#1089;&#1103; &#1087;&#1077;&#1088;&#1074;&#1086;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086; &#1074; WMI &#1082;&#1083;&#1072;&#1089;&#1089;&#1077; MSFT_Volume &#1074; &#1087;&#1086;&#1083;&#1077; Path, &#1075;&#1076;&#1077; &#1085;&#1072;&#1088;&#1103;&#1076;&#1091; &#1089; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; VolumeGUID, &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1083; &#1080; &#1092;&#1080;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081;, &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; </span><span class="c12">{1036c1c4-0000-0000-007e-000000000000}</span><span>. &#1047;&#1072;&#1090;&#1077;&#1084; &#1074; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1079; &#1089;&#1073;&#1086;&#1088;&#1086;&#1082;, &#1084;&#1086;&#1078;&#1077;&#1090; &#1076;&#1072;&#1078;&#1077; 9926, &#1090;&#1072;&#1082;&#1086;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; GUID &#1087;&#1086;&#1103;&#1074;&#1080;&#1083;&#1089;&#1103; &#1080; &#1087;&#1088;&#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1083; &#1074;&#1086; &#1074;&#1089;&#1077;&#1093; &#1089;&#1073;&#1086;&#1088;&#1082;&#1072;&#1093; &#1086;&#1090; 9879 &#1076;&#1086; 10166, &#1072; &#1074;&#1086;&#1090; &#1074; 10240 &ndash; &#1086;&#1087;&#1103;&#1090;&#1100; &#1080;&#1089;&#1095;&#1077;&#1079; &#1074; &#1089;&#1074;&#1103;&#1079;&#1080; &#1089; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; VolumeGUID. </span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1059;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1102; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1083;&#1077; F1 &#1101;&#1090;&#1086;&#1075;&#1086; GUID &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1100; &#1076;&#1080;&#1089;&#1082;&#1072;, &#1072; &#1087;&#1086;&#1083;&#1103; F4, F5 &ndash; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1090;&#1086;&#1084;&#1072;. &#1058;&#1072;&#1082; &#1095;&#1090;&#1086; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1074; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1090;&#1072;&#1082;&#1086;&#1081; VolumeGUID, &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1083;&#1086;&#1089;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1084; &#1087;&#1088;&#1080;&#1089;&#1074;&#1086;&#1080;&#1090;&#1100; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1082;&#1083;&#1102;&#1095;&#1080; &#1087;&#1088;&#1103;&#1084;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084; LogicalVolumesCollection &#1074;&#1089;&#1077;&#1084; &#1095;&#1083;&#1077;&#1085;&#1072;&#1084; LVGroup. &#1045;&#1097;&#1077; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1079; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;, &#1087;&#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1103; &#1091;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1102; &#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; VolumeGUID &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1085;&#1077; &#1089;&#1084;&#1086;&#1090;&#1088;&#1103; &#1085;&#1072; &#1085;&#1077;&#1089;&#1086;&#1084;&#1085;&#1077;&#1085;&#1085;&#1091;&#1102; &#1088;&#1077;&#1074;&#1086;&#1083;&#1102;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080;&#1076;&#1077;&#1080; &#1086;&#1073; &#1091;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1077;&#1085;&#1080;&#1080; VolumeGUID &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1089; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1086;&#1084; &#1084;&#1086;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1090;&#1086;&#1084;&#1086;&#1074;, &#1074;&#1087;&#1077;&#1088;&#1074;&#1099;&#1077; &#1074;&#1085;&#1077;&#1076;&#1088;&#1077;&#1085;&#1085;&#1091;&#1102; &#1074; &#1089;&#1073;&#1086;&#1088;&#1082;&#1077; 10240, &#1090;&#1077;&#1084; &#1085;&#1077; &#1084;&#1077;&#1085;&#1077;&#1077; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1089;&#1072;&#1084;&#1080;&#1093; GUID &#1086;&#1082;&#1072;&#1079;&#1072;&#1083;&#1089;&#1103; &#1085;&#1077;&#1091;&#1076;&#1072;&#1095;&#1085;&#1099;&#1084; &#1074; &#1090;&#1086;&#1084; &#1089;&#1084;&#1099;&#1089;&#1083;&#1077;, &#1095;&#1090;&#1086; &#1076;&#1083;&#1103; Mbr-&#1076;&#1080;&#1089;&#1082;&#1086;&#1074;, &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1093; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072; &#1080; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1090;&#1086;&#1084;&#1072;, &#1076;&#1074;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1093; &#1087;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;&#1102;&#1090; &#1074; &#1053;&#1045;&#1055;&#1056;&#1040;&#1042;&#1048;&#1051;&#1068;&#1053;&#1054;&#1052; &#1055;&#1054;&#1056;&#1071;&#1044;&#1050;&#1045;: &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1081; &#1080;&#1084;&#1077;&#1077;&#1090; &#1052;&#1045;&#1053;&#1068;&#1064;&#1045;&#1045; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;, &#1095;&#1077;&#1084; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1081;. </span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1046;&#1077;&#1083;&#1072;&#1102;&#1097;&#1080;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1089;&#1072;&#1084;&#1080; &#1074; &#1101;&#1090;&#1086;&#1084; &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1088;&#1072;&#1079;&#1086;&#1073;&#1088;&#1072;&#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090; Data, &#1072; &#1074; &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1084;&#1086;&#1084; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1077; &#1087;&#1088;&#1080;&#1096;&#1083;&#1086;&#1089;&#1100; &#1074;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; SVGroup &#1085;&#1072; &#1084;&#1077;&#1089;&#1090;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; LVroup, &#1095;&#1090;&#1086; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1073;&#1099;&#1089;&#1090;&#1088;&#1077;&#1077;, &#1095;&#1077;&#1084; &#1087;&#1088;&#1077;&#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; LVGroup &#1074; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;, &#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;&#1072; &#1080; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1072;&#1103; &#1089;&#1073;&#1086;&#1088;&#1082;&#1072; &#1074; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;. </span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1048; &#1085;&#1072;&#1082;&#1086;&#1085;&#1077;&#1094; &#1089;&#1090;&#1086;&#1080;&#1090; &#1086;&#1090;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1087;&#1086; &#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1080; &#1094;&#1080;&#1082;&#1083;&#1072; &#1087;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;, &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1085;&#1099;&#1084; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1074; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1090;&#1086;&#1084;&#1086;&#1074;, &#1091; &#1085;&#1072;&#1089; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1088;&#1072;&#1079;&#1086;&#1073;&#1088;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;&#1086; &#1089;&#1090;&#1080;&#1083;&#1103;&#1084;&#1080; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1086;&#1074; &#1085;&#1072; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093; &#1076;&#1080;&#1089;&#1082;&#1072;&#1093; &#1080; &#1085;&#1072; VHD. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1089;&#1088;&#1072;&#1074;&#1085;&#1080;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; NumberOfSV &#1080; NumberOfLV. &#1057;&#1086;&#1074;&#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1086;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1086; &#1089;&#1074;&#1080;&#1076;&#1077;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1099; &#1085;&#1072; &#1076;&#1080;&#1089;&#1082;&#1077; &#1080;&#1084;&#1077;&#1102;&#1090; &#1089;&#1090;&#1080;&#1083;&#1100; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; Mbr, &#1072; &#1074;&#1086;&#1090; NumberOfLV &lt; NumberOfSV &#1086;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1086; &#1089;&#1074;&#1080;&#1076;&#1077;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1086; &#1089;&#1090;&#1080;&#1083;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; Gpt, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1080;&#1079; Gpt-&#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1086;&#1074;, MSR, &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1090;&#1086;&#1084;&#1072;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span class="c11 c16">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1095;&#1077;&#1090;&#1074;&#1077;&#1088;&#1090;&#1086;&#1075;&#1086; &#1096;&#1072;&#1075;&#1072; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072;: &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1073;&#1091;&#1082;&#1074; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1090;&#1086;&#1084;&#1072;&#1084;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1048;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;:</span><span class="c12">&nbsp;HKLM\SYSTEM\MountedDevices</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1044;&#1072;&#1078;&#1077; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1084; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;&#1084; Windows &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1077;&#1085; &#1101;&#1090;&#1086;&#1090; &#1087;&#1091;&#1090;&#1100;, &#1093;&#1088;&#1072;&#1085;&#1103;&#1097;&#1080;&#1081;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1085;&#1072;&#1088;&#1103;&#1076;&#1091; &#1089; &#1085;&#1091;&#1078;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1077;&#1097;&#1077; &#1080; &#1086;&#1095;&#1077;&#1085;&#1100; &#1084;&#1085;&#1086;&#1075;&#1086; &#1089;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1085;&#1086; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086;&#1081;. &#1054;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1101;&#1090;&#1086; &#1082;&#1072;&#1089;&#1072;&#1077;&#1090;&#1089;&#1103; USB-&#1092;&#1083;&#1101;&#1096;&#1077;&#1082;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1090;&#1077;&#1083;&#1077;&#1092;&#1086;&#1085;&#1086;&#1074;, &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1086;&#1089;&#1085;&#1072;&#1097;&#1077;&#1085;&#1086; micro-SD. &#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1086; &#1074;&#1089;&#1077;&#1093; &#1090;&#1072;&#1082;&#1080;&#1093; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1093; &#1086;&#1095;&#1077;&#1085;&#1100; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1079;&#1072;&#1089;&#1086;&#1088;&#1103;&#1077;&#1090; MountedDevices. &#1057;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1074; &#1074;&#1080;&#1076;&#1091;, &#1095;&#1090;&#1086; &#1085;&#1072; &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1080;&#1079; &#1090;&#1072;&#1082;&#1080;&#1093; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074; &#1074; MountedDevices &#1079;&#1072;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1087;&#1086; &#1076;&#1074;&#1077; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;: &#1086;&#1076;&#1085;&#1072;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1074; &#1087;&#1086;&#1083;&#1077; name &#1080;&#1084;&#1077;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; </span><span class="c12">\??\Volume\VolumeGUID</span><span>&nbsp;&#1080; &#1074;&#1090;&#1086;&#1088;&#1072;&#1103;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1087;&#1086;&#1083;&#1077; name &#1080;&#1084;&#1077;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; </span><span class="c12">\DosDevices\Q:</span><span>. &#1055;&#1086;&#1083;&#1077; value &#1076;&#1083;&#1103; &#1086;&#1073;&#1086;&#1080;&#1093; &#1079;&#1072;&#1087;&#1080;&#1089;&#1077;&#1081; &#1080;&#1084;&#1077;&#1077;&#1090; &#1086;&#1095;&#1077;&#1085;&#1100; &#1076;&#1083;&#1080;&#1085;&#1085;&#1099;&#1081; 16-&#1088;&#1080;&#1095;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1074; UTF-16 &#1091;&#1078;&#1077; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1099;&#1081; &#1085;&#1072;&#1084; PnPDeviceID, &#1087;&#1088;&#1080;&#1095;&#1077;&#1084; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; &#1089; &ldquo;\&rdquo; &#1079;&#1072;&#1084;&#1077;&#1085;&#1077;&#1085;&#1085;&#1099;&#1084; &#1085;&#1072; &ldquo;#&rdquo;. &#1058;&#1072;&#1082;&#1080;&#1077; &#1082;&#1083;&#1102;&#1095;&#1080; &#1087;&#1088;&#1103;&#1084;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1074; LogicalVolumesCollection &#1080; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; &#1083;&#1077;&#1075;&#1082;&#1086; &#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1086;&#1090;&#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1086;&#1074;&#1099;&#1074;&#1072;&#1090;&#1100; &#1085;&#1077;&#1085;&#1091;&#1078;&#1085;&#1099;&#1077; Removables.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1042;&#1089;&#1077; &#1074;&#1099;&#1096;&#1077;&#1089;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1077; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103; &#1080; &#1082; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072;&#1084; &#1076;&#1080;&#1089;&#1082;&#1086;&#1074;, &#1082;&#1072;&#1082; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1093;, &#1090;&#1072;&#1082; &#1080; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093;: &#1089;&#1084;&#1077;&#1085;&#1080;&#1083;&#1080; &#1042;&#1099; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1089;&#1074;&#1086;&#1080;&#1093; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1093; &#1076;&#1080;&#1089;&#1082;&#1086;&#1074;, &#1085;&#1086; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1086;&#1073;&#1086; &#1074;&#1089;&#1077;&#1093; &#1077;&#1075;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072;&#1093; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1077;&#1090; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; MountedDevices &#1076;&#1086; &#1090;&#1077;&#1093; &#1087;&#1086;&#1088;, &#1087;&#1086;&#1082;&#1072; &#1042;&#1099; &#1085;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077;, &#1082; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1091;, Windows &#1089; &#1085;&#1091;&#1083;&#1103;, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1085;&#1077; &#1091;&#1085;&#1080;&#1095;&#1090;&#1086;&#1078;&#1080;&#1090;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1081; Registry, &#1072; &#1087;&#1088;&#1080; &#1074;&#1089;&#1077;&#1093; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;&#1093;, &#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090; MountedDevices &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1077;&#1079;&#1078;&#1072;&#1090;&#1100; &#1080;&#1079; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1077;&#1084;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1074; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1091;&#1102;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1086; &#1090;&#1086;&#1084;, &#1082;&#1072;&#1082; &#1087;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084; &#1087;&#1086;&#1083;&#1103; value &#1074; &#1079;&#1072;&#1087;&#1080;&#1089;&#1103;&#1093; MountedDevices &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1072;&#1090;&#1100; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1090;&#1086;&#1084;&#1072;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; Mbr-&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084; &#1076;&#1080;&#1089;&#1082;&#1072;&#1084; &#1080; Gpt-&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084;. &#1055;&#1088;&#1077;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;: &#1077;&#1089;&#1083;&#1080; &#1087;&#1086;&#1083;&#1077; value &#1080;&#1084;&#1077;&#1077;&#1090; &#1076;&#1083;&#1080;&#1085;&#1091; 24 &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072;, &#1090;&#1086; &#1086;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; Signature, &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1100; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1075;&#1086; &#1076;&#1080;&#1089;&#1082;&#1072;, 8 &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074; &#1080; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;, 16 &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074;. </span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1042;&#1086;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1082;&#1083;&#1102;&#1095;&#1072; &#1076;&#1083;&#1103; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; LogicalVolumesCollection &#1077;&#1097;&#1077; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103;, &#1087;&#1088;&#1077;&#1076;&#1074;&#1072;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1085;&#1072;&#1076;&#1086; &#1080;&#1085;&#1074;&#1077;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080; &#1087;&#1086;&#1083;&#1077; Signature &#1080; &#1087;&#1086;&#1083;&#1077; Offset, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1087;&#1086; &#1085;&#1077;&#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1086;&#1081; &#1084;&#1085;&#1077; &#1076;&#1086; &#1089;&#1080;&#1093; &#1087;&#1086;&#1088; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1077;, &#1101;&#1090;&#1080; &#1087;&#1086;&#1083;&#1103; &#1093;&#1088;&#1072;&#1085;&#1103;&#1090; &#1080;&#1085;&#1074;&#1077;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1091;&#1102; &#1087;&#1086; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1091; &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1073;&#1072;&#1081;&#1090;&#1086;&#1074; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;. &#1058;&#1072;&#1082; &#1095;&#1090;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1074; &#1080;&#1085;&#1074;&#1077;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077; &#1082;&#1083;&#1102;&#1095;&#1072; &#1087;&#1088;&#1103;&#1084;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1074; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1090;&#1086;&#1084;&#1086;&#1074; &#1080;, &#1077;&#1089;&#1083;&#1080; &#1085;&#1072;&#1084; &#1087;&#1086;&#1074;&#1077;&#1079;&#1077;&#1090;, &#1090;&#1086; &#1087;&#1088;&#1080;&#1089;&#1074;&#1086;&#1080;&#1090;&#1100; &#1073;&#1091;&#1082;&#1074;&#1091; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1091; &#1080;&#1079; LogicalVolumesCollection. </span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1053;&#1086; &#1077;&#1089;&#1083;&#1080; &#1085;&#1072;&#1084; &#1085;&#1077; &#1087;&#1086;&#1074;&#1077;&#1079;&#1083;&#1086; &#1089; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;&#1102; MountedDevices &#1080;&#1079; &#1087;&#1086;&#1076;&#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1072;</span><span class="c12">&nbsp;\DosDevices\x</span><span>:, &#1090;&#1086;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1085;&#1072;&#1084; &#1087;&#1086;&#1074;&#1077;&#1079;&#1077;&#1090; &#1089; &#1082;&#1083;&#1102;&#1095;&#1086;&#1084;, &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1080;&#1079; VolumeGUID.F1 + &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1080;&#1079; &#1087;&#1086;&#1083;&#1103; value. &nbsp;&#1048; &#1074;&#1086;&#1090; &#1077;&#1089;&#1083;&#1080; &#1085;&#1072;&#1084; &#1087;&#1086;&#1074;&#1077;&#1079;&#1077;&#1090; &#1089; &#1082;&#1083;&#1102;&#1095;&#1086;&#1084; VolumeGUID.F1 + &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;, &#1090;&#1086; &#1085;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1085;&#1077;&#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1074; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1090;&#1086;&#1084;&#1086;&#1074; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1082;&#1083;&#1102;&#1095;&#1080; &#1087;&#1088;&#1103;&#1084;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;, &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1080;&#1079; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1080; &#1076;&#1080;&#1089;&#1082;&#1072; + &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1048; &#1085;&#1072;&#1082;&#1086;&#1085;&#1077;&#1094; &#1086; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1090;&#1086;&#1084;&#1072;&#1093; &#1085;&#1072; Gpt-&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1076;&#1080;&#1089;&#1082;&#1072;&#1093;. &#1055;&#1086;&#1083;&#1077; value &#1076;&#1083;&#1103; &#1090;&#1072;&#1082;&#1080;&#1093; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1090;&#1086;&#1084;&#1086;&#1074; &#1080;&#1084;&#1077;&#1077;&#1090; &#1076;&#1083;&#1080;&#1085;&#1091; 48 &#1073;&#1072;&#1081;&#1090;, &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1087;&#1077;&#1088;&#1074;&#1099;&#1077; 16 &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1091;&#1102; 8-&#1102; utf-16 &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072;&#1084;&#1080; &#1080; 32 16-&#1088;&#1080;&#1095;&#1085;&#1099;&#1093; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1077;&#1081; QWORD, &#1089;&#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1080;&#1079; &#1087;&#1086;&#1083;&#1077;&#1081; VolumeGUID. &#1042;&#1086;&#1090; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1081; &#1082;&#1086;&#1085;&#1074;&#1077;&#1088;&#1090;&#1072;&#1094;&#1080;&#1080;:</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span class="c21">String.prototype.ConvertQWORD = function()// converts 32-bytes heximal string</span></p><p class="c4"><span class="c21">{</span></p><p class="c4"><span class="c21">// &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;. &nbsp;. &nbsp;. &nbsp;. &nbsp;x &nbsp;x &nbsp;y &nbsp;y &nbsp;z &nbsp;z &nbsp;t &nbsp;t &nbsp;t &nbsp;t &nbsp;t &nbsp;t</span></p><p class="c4"><span class="c21">// &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;00 02 04 06 08 10 12 14 16 18 20 22 24 26 28 30</span></p><p class="c4"><span class="c21">// 3ab0aea1c467eb4fb392a1a746d349a7 3a b0 ae a1 c4 67 eb 4f b3 92 a1 a7 46 d3 49 a7</span></p><p class="c4"><span class="c21">&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;var t = this.toLowerCase();</span></p><p class="c4"><span class="c21">&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;return t.substr( 06, 02 ) + t.substr( 04, 02 ) + t.substr( 02, 02 ) + t.substr( 00, 02 ) +</span></p><p class="c4"><span class="c21">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;t.substr( 10, 02 ) + t.substr( 08, 02 ) + // 4 xx</span></p><p class="c4"><span class="c21">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;t.substr( 14, 02 ) + t.substr( 12, 02 ) + // 4 yy</span></p><p class="c4"><span class="c21">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;t.substr( 16, 02 ) + t.substr( 18, 02 ) + // 4 zz</span></p><p class="c4"><span class="c21">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;t.substr( 20, 12 ); // 12 }</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1042; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1080; &#1086;&#1090; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1090;&#1086;&#1084;&#1086;&#1074; &#1076;&#1083;&#1103; Mbr-&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1076;&#1080;&#1089;&#1082;&#1086;&#1074;, &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1080;&#1079; &#1090;&#1086;&#1084;&#1086;&#1074; &#1085;&#1072; Gpt-&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1084; &#1076;&#1080;&#1089;&#1082;&#1077; &#1074; MountedDevices &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1085;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;. &#1055;&#1088;&#1080;&#1095;&#1077;&#1084; &#1090;&#1086;&#1084;&#1072; Gpt-&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1076;&#1080;&#1089;&#1082;&#1086;&#1074;, &#1085;&#1077; &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1077; &#1073;&#1091;&#1082;&#1074;&#1099;, &#1074; MountedDevices &#1085;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; VolumeGUID &nbsp;&#1087;&#1086; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1074;&#1099;&#1096;&#1077; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1091;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1087;&#1086;&#1083;&#1077; F1 &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1082;&#1083;&#1102;&#1095;&#1072; &#1087;&#1088;&#1103;&#1084;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1090;&#1086;&#1084;&#1086;&#1074;.</span></p><p class="c4"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 602.00px; height: 210.67px;">
<img alt="" src="image05.png" style="width: 602.00px; height: 210.67px; margin-left: 0.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span></p><p class="c4"><span>&#1056;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 5.</span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1056;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 5 &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090; &#1083;&#1086;&#1075;&#1080;&#1082;&#1091; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1096;&#1072;&#1075;&#1072; 4: &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1087;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077; &#1087;&#1086;&#1076;&#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1072; MountedDevices, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1077;&#1075;&#1086; VolumeGUID, &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1086;&#1074;&#1099;&#1077; &#1082;&#1083;&#1102;&#1095;&#1080; &#1087;&#1088;&#1103;&#1084;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; Signature+Offset, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1087;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077; &#1087;&#1086;&#1076;&#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1072; DosDevices, &#1101;&#1090;&#1080; &#1085;&#1086;&#1074;&#1099;&#1077; &#1082;&#1083;&#1102;&#1095;&#1080; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &ldquo;SetMountNameForMountPoint&rdquo;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1082;&#1088;&#1072;&#1090;&#1082;&#1086;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1086;. &#1053;&#1072; GitHub &#1077;&#1097;&#1077; &#1084;&#1077;&#1089;&#1103;&#1094; &#1085;&#1072;&#1079;&#1072;&#1076; &#1073;&#1099;&#1083;&#1086; &#1074;&#1099;&#1083;&#1086;&#1078;&#1077;&#1085;&#1086; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1089; &#1084;&#1072;&#1089;&#1089;&#1086;&#1081; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1085;&#1072; VM/CMS, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1074;&#1087;&#1077;&#1088;&#1074;&#1099;&#1077; &#1087;&#1086;&#1103;&#1074;&#1080;&#1083;&#1080;&#1089;&#1100; &#1073;&#1091;&#1082;&#1074;&#1099;, &#1085;&#1072; *NIX &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1077;&#1082;&#1088;&#1072;&#1089;&#1085;&#1086; &#1086;&#1073;&#1093;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1080; &#1073;&#1077;&#1079; &#1073;&#1091;&#1082;&#1074;, &#1085;&#1086; &#1083;&#1091;&#1095;&#1096;&#1077; &#1090;&#1072;&#1084; &#1078;&#1077; &#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090; EnumDevicesAndVolumes.wsf, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1091;&#1087;&#1086;&#1084;&#1103;&#1085;&#1091;&#1090;&#1099;&#1081; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1099;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1080;&#1079; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1077;&#1074;, &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1085;&#1099;&#1093; &#1080;&#1079; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1082;&#1086;&#1076;&#1072;, &#1087;&#1088;&#1080;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1091;&#1078;&#1077; &#1091;&#1089;&#1090;&#1072;&#1088;&#1077;&#1083;&#1099;&#1084;&#1080;, &#1085;&#1077; &#1086;&#1095;&#1077;&#1085;&#1100; &#1074;&#1085;&#1103;&#1090;&#1085;&#1099;&#1084;&#1080; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1103;&#1084;&#1080; &#1085;&#1072; en-RU, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1082; &#1089;&#1077;&#1088;&#1077;&#1076;&#1080;&#1085;&#1077; &#1092;&#1088;&#1072;&#1079;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;, &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1099;&#1081; &#1089; &#1088;&#1086;&#1084;&#1072;&#1085;&#1072;&#1084;&#1080; &#1058;&#1086;&#1083;&#1089;&#1090;&#1086;&#1075;&#1086;, &#1077;&#1097;&#1077; &#1085;&#1077; &#1079;&#1072;&#1073;&#1091;&#1076;&#1077;&#1090; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1078;&#1077; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1083;&#1086;&#1089;&#1100; &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1092;&#1088;&#1072;&#1079;&#1099;. &#1042;&#1089;&#1077; &#1078;&#1077; &#1089;&#1090;&#1080;&#1083;&#1100; &#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1085;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1090;&#1088;&#1091;&#1076;&#1085;&#1077;&#1077;, &#1095;&#1077;&#1084; &#1089;&#1090;&#1080;&#1083;&#1100; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1086;&#1074; &#1085;&#1072; &#1076;&#1080;&#1089;&#1082;&#1077;.</span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1055;&#1088;&#1080; &#1095;&#1090;&#1077;&#1085;&#1080;&#1080; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1077;&#1074; &#1085;&#1077; &#1090;&#1086;&#1088;&#1086;&#1087;&#1080;&#1090;&#1077;&#1089;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1076;&#1080;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080; &#1095;&#1090;&#1077;&#1085;&#1080;&#1080; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1086;&#1076;&#1085;&#1086;&#1081; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1082;&#1086;&#1076;&#1072; &#1087;&#1088;&#1077;&#1076;&#1096;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; 10 &#1089;&#1090;&#1088;&#1086;&#1082; &#1087;&#1086;&#1103;&#1089;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1077;&#1074;: &#1101;&#1090;&#1086; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1082;&#1080;&#1081; &#1086;&#1095;&#1077;&#1085;&#1100; &#1074;&#1072;&#1078;&#1085;&#1099;&#1081; &#1076;&#1083;&#1103; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072; &#1082;&#1086;&#1076;. &#1058;&#1072;&#1082; &#1078;&#1077; &#1082;&#1072;&#1082; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1090;&#1086;&#1095;&#1085;&#1099;&#1077; &#1090;&#1077;&#1075;&#1080; &#1074; &#1082;&#1086;&#1085;&#1094;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;, &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1102;&#1097;&#1080;&#1077; &#1080;&#1084;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084;&#1091; &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1080;&#1090; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;. &#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1090;&#1088;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; DevicesCollection, StorageVolumesCollection &#1080; LogicalVolumesCollection &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1086;&#1093;&#1086;&#1078;&#1080; &#1082;&#1072;&#1082; &#1087;&#1086; &#1083;&#1086;&#1075;&#1080;&#1082;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1090;&#1072;&#1082; &#1080; &#1087;&#1086; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1091; &#1082;&#1086;&#1076;&#1072;, &#1090;&#1086; &#1090;&#1072;&#1082;&#1080;&#1077; &#1090;&#1077;&#1075;&#1080; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1083;&#1077;&#1075;&#1082;&#1086; &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1076;&#1083;&#1080;&#1085;&#1085;&#1086;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077;. &#1054;&#1073;&#1097;&#1080;&#1077; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1074;&#1099;&#1085;&#1077;&#1089;&#1077;&#1085;&#1099; &#1085;&#1072;&#1074;&#1077;&#1088;&#1093;, &#1085;&#1086; &#1074;&#1086;&#1090; &#1082; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1091;, &#1087;&#1072;&#1088;&#1089;&#1080;&#1085;&#1075; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1093; &#1089;&#1090;&#1088;&#1086;&#1082; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074; &#1088;&#1072;&#1079;&#1085;&#1080;&#1090;&#1089;&#1103; &#1086;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1082; &#1082;&#1083;&#1072;&#1089;&#1089;&#1091; &#1080; &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1085;&#1072; &#1074;&#1089;&#1077;&#1093; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077;&#1093; &#1096;&#1072;&#1075;&#1072;&#1093; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072;.</span></p><p class="c4 c5"><span></span></p><p class="c4"><span class="c11 c16">&#1054;&#1073; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1077; StdRegWrapperClass, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1084; &#1074;&#1089;&#1077;&#1084;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1084;&#1080; &#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;&#1084;&#1080; &#1076;&#1083;&#1103; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080;&#1079; Registry.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>&#1069;&#1090;&#1086; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1103; &#1077;&#1075;&#1086; &#1090;&#1072;&#1082; &#1080;&#1084;&#1077;&#1085;&#1091;&#1102;, &ldquo;&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081;&rdquo;, &#1072; &#1074;&#1086;&#1090; &#1082;&#1086;&#1075;&#1076;&#1072; &#1087;&#1080;&#1089;&#1072;&#1083;, &#1090;&#1086; &nbsp;&#1086;&#1095;&#1077;&#1085;&#1100; &#1075;&#1086;&#1088;&#1076;&#1080;&#1083;&#1089;&#1103;, &#1072; &#1074;&#1086;&#1090; &#1082;&#1086;&#1076; &#1076;&#1083;&#1103; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080;&#1079; Registry, &#1087;&#1088;&#1077;&#1079;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1083; TestCase. &#1053;&#1086; &#1074;&#1086;&#1090; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1084;&#1085;&#1077; &#1074;&#1099;&#1075;&#1086;&#1076;&#1085;&#1077;&#1081; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1087;&#1086; &#1090;&#1086;&#1081; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1077;, &#1095;&#1090;&#1086; &#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1085;&#1086; &#1085;&#1077; &#1091;&#1089;&#1087;&#1077;&#1083; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1074; &#1077;&#1075;&#1086; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074; Set, Delete &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1083;&#1077;&#1075;&#1082;&#1086; &#1086;&#1087;&#1088;&#1072;&#1074;&#1076;&#1099;&#1074;&#1072;&#1077;&#1090; &#1101;&#1090;&#1086; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; - &#1053;&#1045; &#1058;&#1056;&#1045;&#1041;&#1059;&#1070;&#1058;&#1057;&#1071; Set / Delete &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1076;&#1083;&#1103; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1086;&#1081; &#1074;&#1099;&#1096;&#1077; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;. &#1053;&#1086; &#1103; &#1089;&#1086;&#1073;&#1080;&#1088;&#1072;&#1102;&#1089;&#1100; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089; &#1080; &#1085;&#1077;&#1087;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1074;&#1082;&#1083;&#1102;&#1095;&#1091; &#1074; &#1077;&#1075;&#1086; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074; &#1074;&#1089;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080;&#1079; StdRegProv. &#1053;&#1072;&#1076;&#1077;&#1102;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1076;&#1072;&#1078;&#1077; &#1074; &#1090;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1072;&#1074;&#1075;&#1091;&#1089;&#1090;&#1072;. </span></p><p class="c4 c5"><span></span></p><p class="c4"><span class="c11 c16">&#1054;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; &#1080; &#1085;&#1077;&#1076;&#1086;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072;&#1093; &#1074; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1077; &#1080; &#1082;&#1086;&#1076;&#1077;.</span></p><p class="c4 c5"><span class="c11 c16"></span></p><p class="c4"><span>&#1045;&#1089;&#1090;&#1100; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1074; &#1082;&#1086;&#1076;&#1077; &#1085;&#1072; &#1096;&#1072;&#1075;&#1077; 4 &#1074; &#1094;&#1080;&#1082;&#1083;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1089;&#1090;&#1088;&#1086;&#1082;, &#1089;&#1095;&#1080;&#1090;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080;&#1079; MountedDevices: &#1085;&#1077;&#1086;&#1078;&#1080;&#1076;&#1072;&#1085;&#1085;&#1086; &#1074; &#1093;&#1086;&#1076;&#1077; &#1086;&#1090;&#1083;&#1072;&#1076;&#1082;&#1080; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1083;&#1086;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072; &#1089; VolumeGUID &#1080;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1073;&#1077;&#1079; &#1073;&#1091;&#1082;&#1074;&#1099;, &#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1079;&#1078;&#1077;, &#1095;&#1077;&#1084; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1099; &#1074;&#1089;&#1077; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; DosDevices. &#1053;&#1077; &#1089;&#1090;&#1072;&#1083; &#1090;&#1077;&#1088;&#1103;&#1090;&#1100; &#1074;&#1088;&#1077;&#1084;&#1103;, &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1085;&#1077;&#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1086; &#1075;&#1076;&#1077; &#1087;&#1088;&#1103;&#1095;&#1077;&#1090;&#1089;&#1103;, &#1074;&#1087;&#1086;&#1083;&#1085;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1074; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1077;. &#1055;&#1086;&#1090;&#1086;&#1084;&#1091; &#1083;&#1080;&#1096;&#1100; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1083; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072; &#1085;&#1072; O(N), &#1075;&#1076;&#1077; N - &#1095;&#1080;&#1089;&#1083;&#1086; &#1089;&#1090;&#1088;&#1086;&#1082; &#1074; MountedDevices, &#1088;&#1072;&#1079;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1103; &#1089;&#1095;&#1080;&#1090;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1087;&#1086; &#1076;&#1074;&#1091;&#1084; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;&#1072;&#1084;, &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090; &#1083;&#1080;&#1096;&#1100; VolumeGUID &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;, &#1072; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1083;&#1080;&#1096;&#1100; DosDevices &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;. &#1047;&#1072;&#1090;&#1077;&#1084; &#1074; &#1077;&#1097;&#1077; &#1086;&#1076;&#1085;&#1086;&#1084; &#1094;&#1080;&#1082;&#1083;&#1077; &#1076;&#1083;&#1080;&#1085;&#1099; N &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1080;&#1079; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;&#1072;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1080;&#1079; &#1074;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086;. &#1053;&#1077;&#1087;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1088;&#1072;&#1079;&#1073;&#1077;&#1088;&#1091;&#1089;&#1100; &#1080; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1102;.</span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1042; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1094;&#1080;&#1080; &#1076;&#1072;&#1090;&#1099; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; REG_QWORD &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;. &#1055;&#1086;&#1090;&#1088;&#1072;&#1090;&#1080;&#1083; &#1085;&#1072; &#1086;&#1090;&#1083;&#1072;&#1076;&#1082;&#1091; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1072;&#1089;&#1086;&#1074;, &#1085;&#1086; &#1088;&#1072;&#1079;&#1086;&#1073;&#1088;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1077; &#1089;&#1084;&#1086;&#1075;. &#1041;&#1099;&#1083; &#1073;&#1099; &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1090;&#1077;&#1083;&#1077;&#1085;, &#1077;&#1089;&#1083;&#1080; &#1073;&#1099; &#1082;&#1090;&#1086;-&#1090;&#1086; &#1087;&#1088;&#1080;&#1089;&#1083;&#1072;&#1083; &#1084;&#1085;&#1077; &#1090;&#1086;&#1095;&#1085;&#1086; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1091;&#1102; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1094;&#1080;&#1102; &#1093;&#1086;&#1090;&#1100; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1079; &#1076;&#1072;&#1090; &#1074; Registry, &#1093;&#1088;&#1072;&#1085;&#1080;&#1084;&#1099;&#1093; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; REG_QWORD.</span></p><p class="c4"><span>&#1069;&#1090;&#1091; &ldquo;&#1073;&#1086;&#1083;&#1100;&#1085;&#1086;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086;&rdquo;, &#1086;&#1095;&#1077;&#1085;&#1100; &#1093;&#1086;&#1095;&#1077;&#1090;&#1089;&#1103; &#1079;&#1072;&#1092;&#1080;&#1082;&#1089;&#1080;&#1090;&#1100;.</span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1057;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1085;&#1086; &#1085;&#1077;&#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1086; &#1076;&#1083;&#1103; &#1084;&#1077;&#1085;&#1103;, &#1095;&#1090;&#1086; &#1078;&#1077; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1089;&#1103; &#1074; &#1087;&#1077;&#1088;&#1074;&#1099;&#1093; &#1074;&#1086;&#1089;&#1100;&#1084;&#1080; &#1073;&#1072;&#1081;&#1090;&#1072;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; Identifier, </span><span class="c12">HKLM\HARDWARE\DESCRIPTION\System\MultifunctionAdapter\0\DiskController\0\DiskPeripheral</span><span>, &nbsp;&quot;Identifier&quot;=&quot;9cb5ff90-00000000-A&quot;. &#1053;&#1080;&#1082;&#1072;&#1082;&#1080;&#1093; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1093; &#1080;&#1076;&#1077;&#1081; &#1085;&#1072; &#1101;&#1090;&#1086; &#1089;&#1095;&#1077;&#1090; &#1085;&#1077;&#1090;, &#1087;&#1086;&#1080;&#1089;&#1082;&#1080; &#1074; Registry &#1076;&#1072;&#1102;&#1090; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;. &#1045;&#1089;&#1083;&#1080; &#1082;&#1090;&#1086;-&#1090;&#1086; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1076;&#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1090;&#1086; &#1073;&#1091;&#1076;&#1091; &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1090;&#1077;&#1083;&#1077;&#1085;.</span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1053;&#1077; &#1076;&#1086; &#1082;&#1086;&#1085;&#1094;&#1072; &#1088;&#1072;&#1079;&#1086;&#1073;&#1088;&#1072;&#1083;&#1089;&#1103; &#1089;&#1086; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1086;&#1081; &#1073;&#1083;&#1086;&#1073;&#1072; Data &#1080;&#1079; MountPoints2\CPC\Volume. &#1053;&#1086; &#1086;&#1089;&#1086;&#1073;&#1086;&#1081; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1099; &#1090;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1085;&#1072; &#1101;&#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103;, &#1085;&#1077; &#1074;&#1080;&#1078;&#1091;. &#1044;&#1072;, &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1073;&#1099;&#1083;&#1086; &#1073;&#1099; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1100; &#1086;&#1090;&#1090;&#1091;&#1076;&#1072; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1090;&#1086;&#1084;&#1086;&#1074;, &#1085;&#1086; &#1074;&#1086;&#1090; &#1085;&#1077; &#1085;&#1072;&#1096;&#1077;&#1083; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1103;&#1097;&#1077;&#1075;&#1086; &#1087;&#1086;&#1083;&#1103; &#1089;&#1088;&#1077;&#1076;&#1080; &#1090;&#1077;&#1093;, &#1095;&#1090;&#1086; &#1077;&#1097;&#1077; &#1085;&#1077; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083;. &#1053;&#1086; &#1074;&#1089;&#1077; &#1078;&#1077; &#1087;&#1072;&#1088;&#1091; &#1095;&#1072;&#1089;&#1086;&#1074; &#1087;&#1086;&#1090;&#1088;&#1072;&#1095;&#1091;.</span></p><p class="c4 c5"><span></span></p><p class="c4"><span class="c11">&#1050;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1093; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1087;&#1086; &#1090;&#1077;&#1084;&#1077; &#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080;.</span></p><p class="c4 c5"><span class="c11"></span></p><p class="c4"><span>http://www.script-coding.com/WMI.html - &#1086;&#1090;&#1083;&#1080;&#1095;&#1085;&#1072;&#1103; &#1089;&#1090;&#1072;&#1090;&#1100;&#1103; &#1086; WMI coding, &#1086;&#1090;&#1083;&#1080;&#1095;&#1085;&#1099;&#1081; &#1088;&#1086;&#1089;&#1089;&#1080;&#1081;&#1089;&#1082;&#1080;&#1081; &#1089;&#1072;&#1081;&#1090;, &#1087;&#1086;&#1089;&#1074;&#1103;&#1097;&#1077;&#1085;&#1085;&#1099;&#1081; Scripting, &nbsp;&#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1084;&#1072;&#1089;&#1089;&#1091; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1099;&#1081; &#1089;&#1090;&#1072;&#1090;&#1077;&#1081;.</span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1048;&#1084;&#1077;&#1085;&#1085;&#1086; &#1073;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1103; &#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1072;&#1094;&#1080;&#1103;&#1084; &#1085;&#1072; &#1101;&#1090;&#1086;&#1084; &#1089;&#1072;&#1081;&#1090;&#1077; &#1103; &#1089;&#1090;&#1072;&#1083; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; WSF-&#1082;&#1086;&#1076; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &ldquo;&#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1085;&#1100;&rdquo; &#1085;&#1072; &#1095;&#1080;&#1089;&#1090;&#1086;&#1084; JS. &#1047;&#1072;&#1084;&#1077;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1089;&#1072;&#1081;&#1090;. &nbsp; &nbsp; </span></p><p class="c4 c5"><span></span></p><p class="c4"><span class="c10"><a class="c14" href="https://www.google.com/url?q=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fdownload%2Fdetails.aspx%3Fid%3D12028&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNHanVtFdKGaHQ0z2SwBldf8lY5qHw">https://www.microsoft.com/en-us/download/details.aspx?id=12028</a></span><span>&nbsp;- &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1083;&#1091;&#1095;&#1096;&#1077;&#1075;&#1086; &#1074; &#1084;&#1086;&#1077;&#1084; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &ldquo;&#1091;&#1095;&#1077;&#1073;&#1085;&#1080;&#1082;&#1072;&rdquo; &#1087;&#1086; WMI-&#1084;&#1077;&#1090;&#1086;&#1076;&#1072;&#1084;, ScriptomaticV2.hta. MUST HAVE &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1086;&#1074; &#1085;&#1072; JS, VBS, Perl &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; WMI-&#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074;. &#1042;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1080;&#1082; &#1082;&#1086;&#1076;&#1072; &#1076;&#1083;&#1103; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1074; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1075;&#1088;&#1086;&#1084;&#1072;&#1076;&#1085;&#1077;&#1081;&#1096;&#1077;&#1075;&#1086; &#1076;&#1077;&#1088;&#1077;&#1074;&#1072; &nbsp;WMI-&#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1085;&#1072; &#1086;&#1076;&#1085;&#1086;&#1084; &#1080;&#1079; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1093; &#1103;&#1079;&#1099;&#1082;&#1086;&#1074;. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; </span></p><p class="c4 c5"><span class="c11"></span></p><p class="c4"><span>&#1062;&#1080;&#1082;&#1083; &#1080;&#1079; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1089;&#1090;&#1072;&#1090;&#1077;&#1081; &#1085;&#1072; &#1087;&#1086;&#1088;&#1090;&#1072;&#1083;&#1077; </span><span class="c10"><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fwww.forensicmag.com&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNG2cH2Nl-1ogErKbVT8580f5N048A">http://www.forensicmag.com</a></span></p><p class="c4 c5"><span></span></p><p class="c4"><span class="c10"><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fwww.forensicmag.com%2Farticles%2F2011%2F12%2Fwindows-7-registry-forensics-part-2&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNF-tx40ekJU7U2hczRXDlc-D6BClg">http://www.forensicmag.com/articles/2011/12/windows-7-registry-forensics-part-2</a></span></p><p class="c4"><span class="c10"><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fwww.forensicmag.com%2Farticles%2F2012%2F02%2Fwindows-7-registry-forensics-part-3&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNEZK2v11yuW9EDMcC7b9-s1taXZNw">http://www.forensicmag.com/articles/2012/02/windows-7-registry-forensics-part-3</a></span></p><p class="c4 c5"><span></span></p><p class="c4"><span class="c10"><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fwww.forensicmag.com%2Farticles%2F2012%2F06%2Fretrieving-digital-evidence-methods-techniques-and-issues-part-3&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNGTSqL96alemOcfWhmlsSLLCfLrIA">http://www.forensicmag.com/articles/2012/06/retrieving-digital-evidence-methods-techniques-and-issues-part-3</a></span></p><p class="c4 c5"><span></span></p><p class="c4"><span class="c10"><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fwww.forensicmag.com%2Farticles%2F2012%2F04%2Fwindows-7-registry-forensics-part-4&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNFXvLoBXMwUrhWyxFl9exis8D69Ow">http://www.forensicmag.com/articles/2012/04/windows-7-registry-forensics-part-4</a></span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1042; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1081; &#1087;&#1086;&#1088;&#1090;&#1072;&#1083;, &#1087;&#1086;&#1090;&#1088;&#1072;&#1090;&#1080;&#1083; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1072;&#1089;&#1086;&#1074;, &#1095;&#1080;&#1090;&#1072;&#1103; &#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072; &#1101;&#1090;&#1086;&#1084; &#1087;&#1086;&#1088;&#1090;&#1072;&#1083;&#1077;. &#1053;&#1086; &#1089;&#1088;&#1072;&#1079;&#1091; &#1086;&#1090;&#1084;&#1077;&#1095;&#1091;, &#1095;&#1090;&#1086; &#1082; &#1084;&#1086;&#1077;&#1084;&#1091; &#1089;&#1095;&#1072;&#1089;&#1090;&#1100;&#1102; &#1103; &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1087;&#1086;&#1079;&#1076;&#1085;&#1086; &#1077;&#1075;&#1086; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1083;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1091;&#1078;&#1077; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &ldquo;&#1075;&#1083;&#1072;&#1079;&#1077;&#1085;&#1082;&#1072;&#1084;&#1080;&rdquo; &#1091;&#1089;&#1087;&#1077;&#1083; &#1088;&#1072;&#1079;&#1086;&#1073;&#1088;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1090;&#1086;&#1084;, &#1075;&#1076;&#1077; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1074; Registry &#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1072;&#1082;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;, &#1072; &#1075;&#1076;&#1077; &#1085;&#1072;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &ldquo;&#1084;&#1091;&#1089;&#1086;&#1088;&#1086;&#1089;&#1073;&#1086;&#1088;&#1082;&#1080;&rdquo;, &#1093;&#1088;&#1072;&#1085;&#1103;&#1097;&#1080;&#1077; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1093;&#1086;&#1090;&#1100; &#1086;&#1076;&#1085;&#1072;&#1078;&#1076;&#1099; &#1087;&#1086;&#1073;&#1099;&#1074;&#1072;&#1083;&#1086; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;. &#1058;&#1072;&#1082; &#1074;&#1086;&#1090;, &#1072;&#1074;&#1090;&#1086;&#1088; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074;&#1099;&#1096;&#1077; &#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1072;&#1094;&#1080;&#1081; &#1074;&#1099;&#1074;&#1072;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1085;&#1072; &#1085;&#1077;&#1087;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1095;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1103; &#1090;&#1072;&#1082;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1091;&#1090;&#1077;&#1081; &#1074; Registry, &#1095;&#1090;&#1086; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1086;&#1095;&#1077;&#1085;&#1100; &#1084;&#1085;&#1086;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1085;&#1072; &#1090;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1088;&#1072;&#1079;&#1086;&#1073;&#1088;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1084;&#1091;&#1089;&#1086;&#1088;&#1085;&#1099;&#1093; &#1082;&#1091;&#1095;, &#1072;&#1076;&#1088;&#1077;&#1089;&#1091;&#1077;&#1084;&#1099;&#1093; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072;&#1084;&#1080;.</span></p><p class="c4 c5"><span></span></p><p class="c4"><span>http://winintro.ru/diskmgt.ru/html/ebd2bd6e-8b1e-43b6-a2e3-483def6ad763.htm - &#1074;&#1085;&#1103;&#1090;&#1085;&#1072;&#1103; &#1089;&#1090;&#1072;&#1090;&#1100;&#1103; &#1086; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1099;&#1093; &#1090;&#1086;&#1084;&#1072;&#1093; ( Spanned Volumes ) &#1080; &#1076;&#1080;&#1085;&#1072;&#1084;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1076;&#1080;&#1089;&#1082;&#1072;&#1093;.</span></p><p class="c4"><span>&nbsp;</span></p><p class="c4"><span>http://xp-7.ru/blog/2011-01-13-101 - &#1077;&#1097;&#1077; &#1086;&#1076;&#1085;&#1072; &#1080; &#1090;&#1086;&#1078;&#1077; &#1074;&#1085;&#1103;&#1090;&#1085;&#1072;&#1103;, &#1085;&#1086; &#1091;&#1074;&#1080;&#1076;&#1077;&#1083; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1086;&#1088;&#1077;&#1095;&#1080;&#1103; &#1089; &#1087;&#1077;&#1088;&#1074;&#1086;&#1081;.</span></p><p class="c4 c5"><span></span></p><p class="c4"><span>http://www.webtropy.com/articles/art14-2.asp?Interop=WbemScripting &nbsp; - &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1081; Reference &#1087;&#1086; WbemScripting &#1076;&#1083;&#1103; C# and VB.NET</span></p><p class="c4 c5"><span></span></p><p class="c4 c5"><span></span></p><p class="c4 c5"><span></span></p><p class="c4 c5"><span></span></p><p class="c4 c5"><span></span></p><p class="c4 c5"><span></span></p><p class="c4 c5"><span></span></p><p class="c4 c5"><span></span></p><p class="c4 c5"><span></span></p><p class="c4 c5"><span></span></p><p class="c4"><span class="c11">&#1044;&#1083;&#1103; &#1089;&#1072;&#1084;&#1099;&#1093; &#1090;&#1077;&#1088;&#1087;&#1077;&#1083;&#1080;&#1074;&#1099;&#1093;, &#1076;&#1086;&#1073;&#1088;&#1072;&#1074;&#1096;&#1080;&#1093;&#1089;&#1103; &#1076;&#1086; &#1101;&#1090;&#1086;&#1075;&#1086; &#1084;&#1077;&#1089;&#1090;&#1072;.</span></p><p class="c4"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 602.00px; height: 353.33px;"><img alt="" src="image02.jpg" style="width: 602.00px; height: 353.33px; margin-left: 0.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&ldquo;</span><span class="c11">&#1054;&#1090;&#1093;&#1086;&#1076;&#1099; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072;</span><span>&rdquo;</span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1050;&#1072;&#1082; &#1095;&#1072;&#1089;&#1090;&#1086; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1087;&#1088;&#1080; &#1087;&#1086;&#1080;&#1089;&#1082;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072;&#1090;&#1099;&#1082;&#1072;&#1077;&#1096;&#1100;&#1089;&#1103; &#1085;&#1072; &#1090;&#1091;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1072;, &#1085;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1072; &#1080; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1088;&#1077;&#1087;&#1091; &#1087;&#1086;&#1095;&#1077;&#1089;&#1072;&#1074;, &#1085;&#1077;&#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1096;&#1100; &#1074;&#1072;&#1103;&#1090;&#1100; &#1082;&#1086;&#1076;. &#1042;&#1086;&#1090; &#1090;&#1072;&#1082;&#1086;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1081; &#1084;&#1086;&#1077;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1072;&#1103; &#1082;&#1086;&#1076;&#1086;&#1084;, &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1084; &#1079;&#1072; &#1087;&#1072;&#1088;&#1091; &#1095;&#1072;&#1089;&#1086;&#1074;.</span></p><p class="c4 c5"><span></span></p><p class="c4"><span>2015.03.24 22:10:19 - 2015.03.31 15:45:14</span><span><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fpcportal.org.ru%2Fforum%2F8&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNH3pP_PW1qIqJH0hkH5e63Evluhyg">&nbsp;</a></span><span class="c10"><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fpcportal.org.ru%2Fforum%2F8&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNH3pP_PW1qIqJH0hkH5e63Evluhyg">Windows 8.1</a></span><span>&nbsp;Pro 9600</span></p><p class="c4"><span>2015.03.31 16:26:15 - 2015.04.23 02:56:17</span><span><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fpcportal.org.ru%2Fforum%2F60&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNEf76QlibiF-mVLAyD2Iync5J7zYA">&nbsp;</a></span><span class="c10"><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fpcportal.org.ru%2Fforum%2F60&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNEf76QlibiF-mVLAyD2Iync5J7zYA">Windows 10</a></span><span>&nbsp;Pro Technical Preview 10049</span></p><p class="c4"><span>2015.04.23 03:44:13 - 2015.04.29 06:36:13</span><span><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fpcportal.org.ru%2Fforum%2F60&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNEf76QlibiF-mVLAyD2Iync5J7zYA">&nbsp;</a></span><span class="c10"><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fpcportal.org.ru%2Fforum%2F60&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNEf76QlibiF-mVLAyD2Iync5J7zYA">Windows 10</a></span><span>&nbsp;Pro Technical Preview 10061</span></p><p class="c4"><span>2015.04.29 07:25:43 - 2015.05.21 11:32:07</span><span><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fpcportal.org.ru%2Fforum%2F60&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNEf76QlibiF-mVLAyD2Iync5J7zYA">&nbsp;</a></span><span class="c10"><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fpcportal.org.ru%2Fforum%2F60&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNEf76QlibiF-mVLAyD2Iync5J7zYA">Windows 10</a></span><span>&nbsp;Pro Insider Preview 10074</span></p><p class="c4"><span>2015.05.21 14:21:40 - 2015.05.28 21:13:37</span><span><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fpcportal.org.ru%2Fforum%2F60&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNEf76QlibiF-mVLAyD2Iync5J7zYA">&nbsp;</a></span><span class="c10"><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fpcportal.org.ru%2Fforum%2F60&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNEf76QlibiF-mVLAyD2Iync5J7zYA">Windows 10</a></span><span>&nbsp;Pro Insider Preview 10122</span></p><p class="c4"><span>2015.05.28 22:04:16 - 2015.05.30 19:11:22</span><span><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fpcportal.org.ru%2Fforum%2F60&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNEf76QlibiF-mVLAyD2Iync5J7zYA">&nbsp;</a></span><span class="c10"><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fpcportal.org.ru%2Fforum%2F60&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNEf76QlibiF-mVLAyD2Iync5J7zYA">Windows 10</a></span><span>&nbsp;Pro Insider Preview 10125</span></p><p class="c4"><span>2015.05.30 20:16:43 - 2015.07.01 11:17:37</span><span><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fpcportal.org.ru%2Fforum%2F60&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNEf76QlibiF-mVLAyD2Iync5J7zYA">&nbsp;</a></span><span class="c10"><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fpcportal.org.ru%2Fforum%2F60&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNEf76QlibiF-mVLAyD2Iync5J7zYA">Windows 10</a></span><span>&nbsp;Pro Insider Preview 10130</span></p><p class="c4"><span>2015.07.01 12:11:53 - 2015.07.01 13:25:29</span><span><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fpcportal.org.ru%2Fforum%2F60&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNEf76QlibiF-mVLAyD2Iync5J7zYA">&nbsp;</a></span><span class="c10"><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fpcportal.org.ru%2Fforum%2F60&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNEf76QlibiF-mVLAyD2Iync5J7zYA">Windows 10</a></span><span>&nbsp;Pro Insider Preview 10158</span></p><p class="c4"><span>2015.07.01 23:22:08 - 2015.07.03 22:25:40</span><span><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fpcportal.org.ru%2Fforum%2F60&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNEf76QlibiF-mVLAyD2Iync5J7zYA">&nbsp;</a></span><span class="c10"><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fpcportal.org.ru%2Fforum%2F60&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNEf76QlibiF-mVLAyD2Iync5J7zYA">Windows 10</a></span><span>&nbsp;Pro Insider Preview 10159</span></p><p class="c4"><span>2015.07.03 23:21:16 - 2015.07.09 24:24:29</span><span><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fpcportal.org.ru%2Fforum%2F60&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNEf76QlibiF-mVLAyD2Iync5J7zYA">&nbsp;</a></span><span class="c10"><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fpcportal.org.ru%2Fforum%2F60&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNEf76QlibiF-mVLAyD2Iync5J7zYA">Windows 10</a></span><span>&nbsp;Pro Insider Preview 10162</span></p><p class="c4"><span>2015.07.10 01:21:50 -</span><span><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fpcportal.org.ru%2Fforum%2F60&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNEf76QlibiF-mVLAyD2Iync5J7zYA">&nbsp;</a></span><span class="c10"><a class="c14" href="http://www.google.com/url?q=http%3A%2F%2Fpcportal.org.ru%2Fforum%2F60&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNEf76QlibiF-mVLAyD2Iync5J7zYA">Windows 10</a></span><span>&nbsp;Pro Insider Preview 10166</span></p><p class="c4 c5"><span></span></p><p class="c4"><span>&#1048; &#1074; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; github:</span></p><p class="c4 c5"><span></span></p><p class="c4"><span class="c10"><a class="c14" href="https://www.google.com/url?q=https%3A%2F%2Fgithub.com%2Fsysprg-46%2FEnumerateDevicesAndVolumesWin%2Ftree%2Fmaster&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNGJyAnH11f4TpoRceM6WJTfhTcIAQ">https://github.com/sysprg-46/EnumerateDevicesAndVolumesWin/tree/master</a></span></p><p class="c4 c5"><span></span></p>
</body></html>
